
#language: ru
@tree

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АвансовыйОтчетПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АвансовыйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчетПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АвансовыйОтчетПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвансовыйОтчетПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхРаботПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктВыполненныхРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхРаботПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктВыполненныхРаботПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктВыполненныхРаботПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчетаКонтрагентов" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчетаКонтрагентов"

	Дано Я открываю основную форму справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчетаОрганизаций" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчетаОрганизаций"

	Дано Я открываю основную форму справочника "БанковскиеСчетаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БизнесРегионы" 

	Дано Я открываю основную форму списка справочника "БизнесРегионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БизнесРегионы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БизнесРегионы"

	Дано Я открываю основную форму справочника "БизнесРегионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БизнесРегионы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БонусныеПрограммыЛояльности" 

	Дано Я открываю основную форму списка справочника "БонусныеПрограммыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммыЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БонусныеПрограммыЛояльности"

	Дано Я открываю основную форму справочника "БонусныеПрограммыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммыЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыАнализаЦелевыхПоказателей" 

	Дано Я открываю основную форму списка справочника "ВариантыАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму справочника "ВариантыАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыГрафиковКредитовИДепозитов" 

	Дано Я открываю основную форму списка справочника "ВариантыГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыГрафиковКредитовИДепозитов"

	Дано Я открываю основную форму справочника "ВариантыГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыКлассификацииЗадолженности" 

	Дано Я открываю основную форму списка справочника "ВариантыКлассификацииЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКлассификацииЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыКлассификацииЗадолженности"

	Дано Я открываю основную форму справочника "ВариантыКлассификацииЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКлассификацииЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыКомплектацииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ВариантыКомплектацииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКомплектацииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыКомплектацииНоменклатуры"

	Дано Я открываю основную форму справочника "ВариантыКомплектацииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыКомплектацииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтветовАнкет" 

	Дано Я открываю основную форму списка справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтветовАнкет"

	Дано Я открываю основную форму справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтчетов"

	Дано Я открываю основную форму справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииМобильныхПриложений" 

	Дано Я открываю основную форму списка справочника "ВерсииМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииМобильныхПриложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииМобильныхПриложений"

	Дано Я открываю основную форму справочника "ВерсииМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииМобильныхПриложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВетеринарноСопроводительныйДокументВЕТИС" 

	Дано Я открываю основную форму списка справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВетеринарноСопроводительныйДокументВЕТИС"

	Дано Я открываю основную форму справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВЕТИСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВЕТИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВЕТИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВЕТИСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВЕТИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВЕТИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозачетЗадолженностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозачетЗадолженностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВзаимозачетЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗапасов" 

	Дано Я открываю основную форму списка справочника "ВидыЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗапасов"

	Дано Я открываю основную форму справочника "ВидыЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКартЛояльности" 

	Дано Я открываю основную форму списка справочника "ВидыКартЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКартЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКартЛояльности"

	Дано Я открываю основную форму справочника "ВидыКартЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКартЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыМехаГИСМ" 

	Дано Я открываю основную форму списка справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыМехаГИСМ"

	Дано Я открываю основную форму справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНоменклатуры"

	Дано Я открываю основную форму справочника "ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОповещенийКлиентам" 

	Дано Я открываю основную форму списка справочника "ВидыОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОповещенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОповещенийКлиентам"

	Дано Я открываю основную форму справочника "ВидыОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОповещенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПланов" 

	Дано Я открываю основную форму списка справочника "ВидыПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПланов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПланов"

	Дано Я открываю основную форму справочника "ВидыПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПланов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПодарочныхСертификатов" 

	Дано Я открываю основную форму списка справочника "ВидыПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПодарочныхСертификатов"

	Дано Я открываю основную форму справочника "ВидыПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСвязейМеждуПартнерами" 

	Дано Я открываю основную форму списка справочника "ВидыСвязейМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуПартнерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСвязейМеждуПартнерами"

	Дано Я открываю основную форму справочника "ВидыСвязейМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуПартнерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСвязейМеждуФизЛицами" 

	Дано Я открываю основную форму списка справочника "ВидыСвязейМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуФизЛицами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСвязейМеждуФизЛицами"

	Дано Я открываю основную форму справочника "ВидыСвязейМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСвязейМеждуФизЛицами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСделокСКлиентами" 

	Дано Я открываю основную форму списка справочника "ВидыСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСделокСКлиентами"

	Дано Я открываю основную форму справочника "ВидыСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСделокСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВидыСделокСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСделокСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВидыСделокСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСделокСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦен" 

	Дано Я открываю основную форму списка справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦен"

	Дано Я открываю основную форму справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦенПоставщиков" 

	Дано Я открываю основную форму списка справочника "ВидыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦенПоставщиков"

	Дано Я открываю основную форму справочника "ВидыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнутреннееПотреблениеТоваровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровПоставщикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровПоставщикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратТоваровПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВстречаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВстречаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГИСМПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ГИСМПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГИСМПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГИСМПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ГИСМПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГИСМПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГорячиеКлавиши" 

	Дано Я открываю основную форму списка справочника "ГорячиеКлавиши"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГорячиеКлавиши"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГорячиеКлавиши"

	Дано Я открываю основную форму справочника "ГорячиеКлавиши"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГорячиеКлавиши"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиОплаты" 

	Дано Я открываю основную форму списка справочника "ГрафикиОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиОплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиОплаты"

	Дано Я открываю основную форму справочника "ГрафикиОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиОплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппировкиТоварныхОграничений" 

	Дано Я открываю основную форму списка справочника "ГруппировкиТоварныхОграничений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппировкиТоварныхОграничений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппировкиТоварныхОграничений"

	Дано Я открываю основную форму справочника "ГруппировкиТоварныхОграничений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппировкиТоварныхОграничений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыАналитическогоУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыАналитическогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыАналитическогоУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыАналитическогоУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыАналитическогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыАналитическогоУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыДоступаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаПартнеров" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаПартнеров"

	Дано Я открываю основную форму справочника "ГруппыДоступаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаФизическихЛиц"

	Дано Я открываю основную форму справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыРассылокИОповещений" 

	Дано Я открываю основную форму списка справочника "ГруппыРассылокИОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыРассылокИОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыРассылокИОповещений"

	Дано Я открываю основную форму справочника "ГруппыРассылокИОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыРассылокИОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаДенежныхСредств" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаДенежныхСредств"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаДоходовРасходов" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДоходовРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаДоходовРасходов"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаДоходовРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыФинансовогоУчетаРасчетов" 

	Дано Я открываю основную форму списка справочника "ГруппыФинансовогоУчетаРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыФинансовогоУчетаРасчетов"

	Дано Я открываю основную форму справочника "ГруппыФинансовогоУчетаРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыФинансовогоУчетаРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентов"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКонтрагентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКредитовИДепозитов" 

	Дано Я открываю основную форму списка справочника "ДоговорыКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКредитовИДепозитов"

	Дано Я открываю основную форму справочника "ДоговорыКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыКредитовИДепозитовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКредитовИДепозитовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыМеждуОрганизациями" 

	Дано Я открываю основную форму списка справочника "ДоговорыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыМеждуОрганизациями"

	Дано Я открываю основную форму справочника "ДоговорыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ДополнительныеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ДополнительныеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОбработчикиОчередиЗаданий" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОбработчикиОчередиЗаданий"

	Дано Я открываю основную форму справочника "ДополнительныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрайверыОборудования" 

	Дано Я открываю основную форму списка справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрайверыОборудования"

	Дано Я открываю основную форму справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕГАИСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЕГАИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕГАИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕГАИСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЕГАИСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕГАИСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиницыИзмеренияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиницыИзмеренияВЕТИС"

	Дано Я открываю основную форму справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаболеванияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаболеванияВЕТИС"

	Дано Я открываю основную форму справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеНаПеревозкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеНаПеревозкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеНаПеревозкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаданиеТорговомуПредставителюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадачиПроектов" 

	Дано Я открываю основную форму списка справочника "ЗадачиПроектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиПроектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиПроектов"

	Дано Я открываю основную форму справочника "ЗадачиПроектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиПроектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщикуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаказПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщикуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаказПоставщикуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаказПоставщикуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Заметки" 

	Дано Я открываю основную форму списка справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Заметки"

	Дано Я открываю основную форму справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийНовостей" 

	Дано Я открываю основную форму списка справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийНовостей"

	Дано Я открываю основную форму справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗоныДоставки" 

	Дано Я открываю основную форму списка справочника "ЗоныДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗоныДоставки"

	Дано Я открываю основную форму справочника "ЗоныДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыСервисовСопровождения" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыСервисовСопровождения"

	Дано Я открываю основную форму справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнойДокументПодтвержденияНДСПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнструкцииБанку" 

	Дано Я открываю основную форму списка справочника "ИнструкцииБанку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнструкцииБанку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнструкцииБанку"

	Дано Я открываю основную форму справочника "ИнструкцииБанку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнструкцииБанку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнформационныеСсылкиДляФорм" 

	Дано Я открываю основную форму списка справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнформационныеСсылкиДляФорм"

	Дано Я открываю основную форму справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИСМППрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИСМППрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИСМППрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИСМППрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИСМППрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИСМППрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПроверкиИКорректировкиДанных" 

	Дано Я открываю основную форму списка справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПроверкиИКорректировкиДанных"

	Дано Я открываю основную форму справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиДанныхПланирования" 

	Дано Я открываю основную форму списка справочника "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиДанныхПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиДанныхПланирования"

	Дано Я открываю основную форму справочника "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиДанныхПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КартыЛояльности" 

	Дано Я открываю основную форму списка справочника "КартыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КартыЛояльности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КартыЛояльности"

	Дано Я открываю основную форму справочника "КартыЛояльности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КартыЛояльности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассовыеКниги" 

	Дано Я открываю основную форму списка справочника "КассовыеКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассовыеКниги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассовыеКниги"

	Дано Я открываю основную форму справочника "КассовыеКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассовыеКниги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Кассы" 

	Дано Я открываю основную форму списка справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Кассы"

	Дано Я открываю основную форму справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыККМ" 

	Дано Я открываю основную форму списка справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыККМ"

	Дано Я открываю основную форму справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииЦелей" 

	Дано Я открываю основную форму списка справочника "КатегорииЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЦелей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииЦелей"

	Дано Я открываю основную форму справочника "КатегорииЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЦелей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииЭксплуатации" 

	Дано Я открываю основную форму списка справочника "КатегорииЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииЭксплуатации"

	Дано Я открываю основную форму справочника "КатегорииЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторВидовЭкономическойДеятельности" 

	Дано Я открываю основную форму списка справочника "КлассификаторВидовЭкономическойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторВидовЭкономическойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторВидовЭкономическойДеятельности"

	Дано Я открываю основную форму справочника "КлассификаторВидовЭкономическойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторВидовЭкономическойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОКВЭД2" 

	Дано Я открываю основную форму списка справочника "КлассификаторОКВЭД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКВЭД2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОКВЭД2"

	Дано Я открываю основную форму справочника "КлассификаторОКВЭД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКВЭД2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОКПД2" 

	Дано Я открываю основную форму списка справочника "КлассификаторОКПД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКПД2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОКПД2"

	Дано Я открываю основную форму справочника "КлассификаторОКПД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОКПД2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОрганизацийЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОрганизацийЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторТНВЭД" 

	Дано Я открываю основную форму списка справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторТНВЭД"

	Дано Я открываю основную форму справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаНаборов" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНаборов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаНаборов"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНаборов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаНоменклатуры" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаНоменклатуры"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаПартий" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПартий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаПартий"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПартий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиАналитикиУчетаПоПартнерам" 

	Дано Я открываю основную форму списка справочника "КлючиАналитикиУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПоПартнерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиАналитикиУчетаПоПартнерам"

	Дано Я открываю основную форму справочника "КлючиАналитикиУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиАналитикиУчетаПоПартнерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступа" 

	Дано Я открываю основную форму списка справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступа"

	Дано Я открываю основную форму справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиРеестраДокументов" 

	Дано Я открываю основную форму списка справочника "КлючиРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиРеестраДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиРеестраДокументов"

	Дано Я открываю основную форму справочника "КлючиРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиРеестраДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыВалютныхОпераций" 

	Дано Я открываю основную форму списка справочника "КодыВалютныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыВалютныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыВалютныхОпераций"

	Дано Я открываю основную форму справочника "КодыВалютныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыВалютныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоллекцииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "КоллекцииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоллекцииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоллекцииНоменклатуры"

	Дано Я открываю основную форму справочника "КоллекцииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоллекцииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактныеЛицаПартнеров" 

	Дано Я открываю основную форму списка справочника "КонтактныеЛицаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛицаПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактныеЛицаПартнеров"

	Дано Я открываю основную форму справочника "КонтактныеЛицаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛицаПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Контрагенты" 

	Дано Я открываю основную форму списка справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПриобретенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КорректировкаПриобретенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПриобретенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПриобретенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КорректировкаПриобретенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаПриобретенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРеализацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КорректировкаРеализацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаРеализацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРеализацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КорректировкаРеализацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КорректировкаРеализацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛентыНовостей" 

	Дано Я открываю основную форму списка справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛентыНовостей"

	Дано Я открываю основную форму справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛицензииПоставщиковАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицензииПоставщиковАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркетинговыеМероприятия" 

	Дано Я открываю основную форму списка справочника "МаркетинговыеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркетинговыеМероприятия"

	Дано Я открываю основную форму справочника "МаркетинговыеМероприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркетинговыеМероприятияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МаркетинговыеМероприятияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркетинговыеМероприятияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МаркетинговыеМероприятияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаркетинговыеМероприятияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Марки" 

	Дано Я открываю основную форму списка справочника "Марки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Марки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Марки"

	Дано Я открываю основную форму справочника "Марки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Марки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутыПодписания" 

	Дано Я открываю основную форму списка справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутыПодписания"

	Дано Я открываю основную форму справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МобильныеКомпьютеры" 

	Дано Я открываю основную форму списка справочника "МобильныеКомпьютеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеКомпьютеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МобильныеКомпьютеры"

	Дано Я открываю основную форму справочника "МобильныеКомпьютеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеКомпьютеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыГруппДоступа" 

	Дано Я открываю основную форму списка справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыГруппДоступа"

	Дано Я открываю основную форму справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыУпаковок" 

	Дано Я открываю основную форму списка справочника "НаборыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыУпаковок"

	Дано Я открываю основную форму справочника "НаборыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Назначения" 

	Дано Я открываю основную форму списка справочника "Назначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Назначения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Назначения"

	Дано Я открываю основную форму справочника "Назначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Назначения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияДеятельности" 

	Дано Я открываю основную форму списка справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияДеятельности"

	Дано Я открываю основную форму справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменСБанками" 

	Дано Я открываю основную форму списка справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменСБанками"

	Дано Я открываю основную форму справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПродажДляПользователей" 

	Дано Я открываю основную форму списка справочника "НастройкиПродажДляПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПродажДляПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПродажДляПользователей"

	Дано Я открываю основную форму справочника "НастройкиПродажДляПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПродажДляПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРМК" 

	Дано Я открываю основную форму списка справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРМК"

	Дано Я открываю основную форму справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиХозяйственныхОпераций" 

	Дано Я открываю основную форму списка справочника "НастройкиХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиХозяйственныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиХозяйственныхОпераций"

	Дано Я открываю основную форму справочника "НастройкиХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиХозяйственныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЭДО" 

	Дано Я открываю основную форму списка справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЭДО"

	Дано Я открываю основную форму справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЯндексКассы" 

	Дано Я открываю основную форму списка справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЯндексКассы"

	Дано Я открываю основную форму справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Новости" 

	Дано Я открываю основную форму списка справочника "Новости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Новости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Новости"

	Дано Я открываю основную форму справочника "Новости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Новости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Номенклатура" 

	Дано Я открываю основную форму списка справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Номенклатура"

	Дано Я открываю основную форму справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПоставщиков" 

	Дано Я открываю основную форму списка справочника "НоменклатураПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПоставщиков"

	Дано Я открываю основную форму справочника "НоменклатураПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПоставщиковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НоменклатураПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПоставщиковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НоменклатураПоставщиковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераГТД" 

	Дано Я открываю основную форму списка справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераГТД"

	Дано Я открываю основную форму справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиХранения" 

	Дано Я открываю основную форму списка справочника "ОбластиХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбластиХранения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиХранения"

	Дано Я открываю основную форму справочника "ОбластиХранения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбластиХранения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщероссийскийКлассификаторПродукции" 

	Дано Я открываю основную форму списка справочника "ОбщероссийскийКлассификаторПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщероссийскийКлассификаторПродукции"

	Дано Я открываю основную форму справочника "ОбщероссийскийКлассификаторПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщероссийскийКлассификаторПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Организации" 

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Организации"

	Дано Я открываю основную форму справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОрганизацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганизацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОрганизацииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганизацииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений" 

	Дано Я открываю основную форму списка справочника "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"

	Дано Я открываю основную форму справочника "ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветственныеЛицаОрганизаций" 

	Дано Я открываю основную форму списка справочника "ОтветственныеЛицаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЛицаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветственныеЛицаОрганизаций"

	Дано Я открываю основную форму справочника "ОтветственныеЛицаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтветственныеЛицаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтражениеРасхожденийПриИнкассацииДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераОСписанииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомиссионераПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомиссионераПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомиссионераПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОСписанииПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОСписанииПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуОСписанииПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтчетКомитентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтчетКомитентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтчетКомитентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданийОбластейДанных"

	Дано Я открываю основную форму справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЭлектронныхЧековКОтправке" 

	Дано Я открываю основную форму списка справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЭлектронныхЧековКОтправке"

	Дано Я открываю основную форму справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПакетОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПакетОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетЭДПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПакетЭДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетЭДПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетЭДПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПакетЭДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПакетЭДПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиЭлектронныхПисем" 

	Дано Я открываю основную форму списка справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиЭлектронныхПисем"

	Дано Я открываю основную форму справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыКонтекстныхФункциональныхОпций" 

	Дано Я открываю основную форму списка справочника "ПараметрыКонтекстныхФункциональныхОпций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыКонтекстныхФункциональныхОпций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыКонтекстныхФункциональныхОпций"

	Дано Я открываю основную форму справочника "ПараметрыКонтекстныхФункциональныхОпций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыКонтекстныхФункциональныхОпций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка справочника "ПартииТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТМЦВЭксплуатации"

	Дано Я открываю основную форму справочника "ПартииТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Партнеры" 

	Дано Я открываю основную форму списка справочника "Партнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Партнеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Партнеры"

	Дано Я открываю основную форму справочника "Партнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Партнеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартнерыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПартнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартнерыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПартнерыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартнерыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПисьмоОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПисьмоОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПисьмоОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланЗакупокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланЗакупокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланЗакупокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланЗакупокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланЗакупокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланЗакупокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОстатковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланОстатковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланОстатковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОстатковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланОстатковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланОстатковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПоКатегориямПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланПродажПоКатегориямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПоКатегориямПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПоКатегориямПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланПродажПоКатегориямПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПоКатегориямПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланПродажПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланПродажПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланПродажПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланСборкиРазборкиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПланСборкиРазборкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланСборкиРазборкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланСборкиРазборкиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПланСборкиРазборкиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПланСборкиРазборкиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодарочныеСертификаты" 

	Дано Я открываю основную форму списка справочника "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодарочныеСертификаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодарочныеСертификаты"

	Дано Я открываю основную форму справочника "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодарочныеСертификаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодключаемоеОборудование" 

	Дано Я открываю основную форму списка справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодключаемоеОборудование"

	Дано Я открываю основную форму справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиНаРассылкиИОповещенияКлиентам" 

	Дано Я открываю основную форму списка справочника "ПодпискиНаРассылкиИОповещенияКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодпискиНаРассылкиИОповещенияКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиНаРассылкиИОповещенияКлиентам"

	Дано Я открываю основную форму справочника "ПодпискиНаРассылкиИОповещенияКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодпискиНаРассылкиИОповещенияКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолитикиУчетаСерий" 

	Дано Я открываю основную форму списка справочника "ПолитикиУчетаСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолитикиУчетаСерий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолитикиУчетаСерий"

	Дано Я открываю основную форму справочника "ПолитикиУчетаСерий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолитикиУчетаСерий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолныеПутиКФормам" 

	Дано Я открываю основную форму списка справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолныеПутиКФормам"

	Дано Я открываю основную форму справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиВЕТИС"

	Дано Я открываю основную форму справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеРасширения" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеРасширения"

	Дано Я открываю основную форму справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставщикиУслугСервиса" 

	Дано Я открываю основную форму списка справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставщикиУслугСервиса"

	Дано Я открываю основную форму справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровНаСкладПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоступлениеТоваровНаСкладПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаИнтеграцииС1СДокументооборотом" 

	Дано Я открываю основную форму списка справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаИнтеграцииС1СДокументооборотом"

	Дано Я открываю основную форму справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаНачисленияИСписанияБонусныхБаллов" 

	Дано Я открываю основную форму списка справочника "ПравилаНачисленияИСписанияБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаНачисленияИСписанияБонусныхБаллов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаНачисленияИСписанияБонусныхБаллов"

	Дано Я открываю основную форму справочника "ПравилаНачисленияИСписанияБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаНачисленияИСписанияБонусныхБаллов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбменаСПодключаемымОборудованиемOffline" 

	Дано Я открываю основную форму списка справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбменаСПодключаемымОборудованиемOffline"

	Дано Я открываю основную форму справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбработкиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбработкиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаРаспределенияРасходов" 

	Дано Я открываю основную форму списка справочника "ПравилаРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРаспределенияРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаРаспределенияРасходов"

	Дано Я открываю основную форму справочника "ПравилаРаспределенияРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРаспределенияРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредприятияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредприятияВЕТИС"

	Дано Я открываю основную форму справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПретензииКлиентов" 

	Дано Я открываю основную форму списка справочника "ПретензииКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПретензииКлиентов"

	Дано Я открываю основную форму справочника "ПретензииКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПретензииКлиентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПретензииКлиентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПретензииКлиентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПретензииКлиентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПретензииКлиентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеТоваровУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриобретениеТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеТоваровУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриобретениеТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Приоритеты" 

	Дано Я открываю основную форму списка справочника "Приоритеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Приоритеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Приоритеты"

	Дано Я открываю основную форму справочника "Приоритеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Приоритеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриоритетыОплаты" 

	Дано Я открываю основную форму списка справочника "ПриоритетыОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриоритетыОплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриоритетыОплаты"

	Дано Я открываю основную форму справочника "ПриоритетыОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриоритетыОплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныВозникновенияПретензий" 

	Дано Я открываю основную форму списка справочника "ПричиныВозникновенияПретензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныВозникновенияПретензий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныВозникновенияПретензий"

	Дано Я открываю основную форму справочника "ПричиныВозникновенияПретензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныВозникновенияПретензий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныНеудовлетворенияПервичногоСпроса" 

	Дано Я открываю основную форму списка справочника "ПричиныНеудовлетворенияПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеудовлетворенияПервичногоСпроса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныНеудовлетворенияПервичногоСпроса"

	Дано Я открываю основную форму справочника "ПричиныНеудовлетворенияПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеудовлетворенияПервичногоСпроса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыЗаказовКлиентов" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыЗаказовКлиентов"

	Дано Я открываю основную форму справочника "ПричиныОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыЗаказовПоставщикам" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыЗаказовПоставщикам"

	Дано Я открываю основную форму справочника "ПричиныОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныПроигрышаСделок" 

	Дано Я открываю основную форму списка справочника "ПричиныПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроигрышаСделок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныПроигрышаСделок"

	Дано Я открываю основную форму справочника "ПричиныПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроигрышаСделок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроверкиСостоянияСистемы" 

	Дано Я открываю основную форму списка справочника "ПроверкиСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроверкиСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроверкиСостоянияСистемы"

	Дано Я открываю основную форму справочника "ПроверкиСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроверкиСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродукцияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродукцияВЕТИС"

	Дано Я открываю основную форму справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Проекты" 

	Дано Я открываю основную форму списка справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Проекты"

	Дано Я открываю основную форму справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроектыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПроектыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроектыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроектыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПроектыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроектыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Производители" 

	Дано Я открываю основную форму списка справочника "Производители"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Производители"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Производители"

	Дано Я открываю основную форму справочника "Производители"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Производители"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка справочника "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеАктивыПассивы"

	Дано Я открываю основную форму справочника "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходыРасходыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПрочиеДоходыРасходыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеДоходыРасходыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходыРасходыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПрочиеДоходыРасходыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеДоходыРасходыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМеста" 

	Дано Я открываю основную форму списка справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМеста"

	Дано Я открываю основную форму справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеУчастки" 

	Дано Я открываю основную форму списка справочника "РабочиеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеУчастки"

	Дано Я открываю основную форму справочника "РабочиеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкаКлиентамПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РассылкаКлиентамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкаКлиентамПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкаКлиентамПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РассылкаКлиентамПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкаКлиентамПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияТоваровУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеализацияТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияТоваровУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеализацияТоваровУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияТоваровУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияУслугПрочихАктивовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РеализацияУслугПрочихАктивовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РейтингиПродажНоменклатуры" 

	Дано Я открываю основную форму списка справочника "РейтингиПродажНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РейтингиПродажНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РейтингиПродажНоменклатуры"

	Дано Я открываю основную форму справочника "РейтингиПродажНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РейтингиПродажНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиКонтактныхЛицВСделкахИПроектах" 

	Дано Я открываю основную форму списка справочника "РолиКонтактныхЛицВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицВСделкахИПроектах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиКонтактныхЛицВСделкахИПроектах"

	Дано Я открываю основную форму справочника "РолиКонтактныхЛицВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицВСделкахИПроектах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиКонтактныхЛицПартнеров" 

	Дано Я открываю основную форму списка справочника "РолиКонтактныхЛицПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиКонтактныхЛицПартнеров"

	Дано Я открываю основную форму справочника "РолиКонтактныхЛицПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛицПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиПартнеровВСделкахИПроектах" 

	Дано Я открываю основную форму списка справочника "РолиПартнеровВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиПартнеровВСделкахИПроектах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиПартнеровВСделкахИПроектах"

	Дано Я открываю основную форму справочника "РолиПартнеровВСделкахИПроектах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиПартнеровВСделкахИПроектах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сайты" 

	Дано Я открываю основную форму списка справочника "Сайты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сайты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сайты"

	Дано Я открываю основную форму справочника "Сайты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сайты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СверкаВзаиморасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СверкаВзаиморасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СверкаВзаиморасчетовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СверкаВзаиморасчетовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СделкиСКлиентами" 

	Дано Я открываю основную форму списка справочника "СделкиСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СделкиСКлиентами"

	Дано Я открываю основную форму справочника "СделкиСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СделкиСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СделкиСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СделкиСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СделкиСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СделкиСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СегментыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СегментыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СегментыНоменклатуры"

	Дано Я открываю основную форму справочника "СегментыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СегментыПартнеров" 

	Дано Я открываю основную форму списка справочника "СегментыПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СегментыПартнеров"

	Дано Я открываю основную форму справочника "СегментыПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СегментыПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеГруппы" 

	Дано Я открываю основную форму списка справочника "СезонныеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеГруппы"

	Дано Я открываю основную форму справочника "СезонныеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеГруппыБизнесРегионов" 

	Дано Я открываю основную форму списка справочника "СезонныеГруппыБизнесРегионов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппыБизнесРегионов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеГруппыБизнесРегионов"

	Дано Я открываю основную форму справочника "СезонныеГруппыБизнесРегионов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СезонныеГруппыБизнесРегионов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СерииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерииНоменклатуры"

	Дано Я открываю основную форму справочника "СерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СертификатыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыНоменклатуры"

	Дано Я открываю основную форму справочника "СертификатыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СертификатыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СертификатыНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкидкиНаценки" 

	Дано Я открываю основную форму списка справочника "СкидкиНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкидкиНаценки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкидкиНаценки"

	Дано Я открываю основную форму справочника "СкидкиНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкидкиНаценки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеГруппыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СкладскиеГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеГруппыНоменклатуры"

	Дано Я открываю основную форму справочника "СкладскиеГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеГруппыУпаковок" 

	Дано Я открываю основную форму списка справочника "СкладскиеГруппыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеГруппыУпаковок"

	Дано Я открываю основную форму справочника "СкладскиеГруппыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеГруппыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеПомещения" 

	Дано Я открываю основную форму списка справочника "СкладскиеПомещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеПомещения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеПомещения"

	Дано Я открываю основную форму справочника "СкладскиеПомещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеПомещения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкладскиеЯчейки" 

	Дано Я открываю основную форму списка справочника "СкладскиеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеЯчейки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладскиеЯчейки"

	Дано Я открываю основную форму справочника "СкладскиеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладскиеЯчейки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Склады" 

	Дано Я открываю основную форму списка справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Склады"

	Дано Я открываю основную форму справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСКлиентами" 

	Дано Я открываю основную форму списка справочника "СоглашенияСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСКлиентами"

	Дано Я открываю основную форму справочника "СоглашенияСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСКлиентамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СоглашенияСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСКлиентамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СоглашенияСКлиентамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСКлиентамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСПоставщиками" 

	Дано Я открываю основную форму списка справочника "СоглашенияСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСПоставщиками"

	Дано Я открываю основную форму справочника "СоглашенияСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоглашенияСПоставщикамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СоглашенияСПоставщикамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщикамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоглашенияСПоставщикамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СоглашенияСПоставщикамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоглашенияСПоставщикамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMSПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMSПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанкамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанкамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеОбменСБанкамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеОбменСБанкамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбластейДанных"

	Дано Я открываю основную форму справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияСистемы"

	Дано Я открываю основную форму справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПроцессов" 

	Дано Я открываю основную форму списка справочника "СостоянияПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПроцессов"

	Дано Я открываю основную форму справочника "СостоянияПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗадолженностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СписаниеЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗадолженностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СписаниеЗадолженностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СписаниеЗадолженностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОбеспеченияПотребностей" 

	Дано Я открываю основную форму списка справочника "СпособыОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОбеспеченияПотребностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОбеспеченияПотребностей"

	Дано Я открываю основную форму справочника "СпособыОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОбеспеченияПотребностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыРаспределенияПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка справочника "СпособыРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыРаспределенияПоНаправлениямДеятельности"

	Дано Я открываю основную форму справочника "СпособыРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаОПодтверждающихДокументахПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкаОПодтверждающихДокументахПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки1ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки1ЕГАИС"

	Дано Я открываю основную форму справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки2ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки2ЕГАИС"

	Дано Я открываю основную форму справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиСПАРКРискиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СправкиСПАРКРискиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиСПАРКРискиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиСПАРКРискиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СправкиСПАРКРискиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СправкиСПАРКРискиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтанцииУправленияЗаказамиИСМП" 

	Дано Я открываю основную форму списка справочника "СтанцииУправленияЗаказамиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтанцииУправленияЗаказамиИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтанцииУправленияЗаказамиИСМП"

	Дано Я открываю основную форму справочника "СтанцииУправленияЗаказамиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтанцииУправленияЗаказамиИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиДвиженияДенежныхСредств" 

	Дано Я открываю основную форму списка справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиДвиженияДенежныхСредств"

	Дано Я открываю основную форму справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураПредприятия" 

	Дано Я открываю основную форму списка справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураПредприятия"

	Дано Я открываю основную форму справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураЦелей" 

	Дано Я открываю основную форму списка справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураЦелей"

	Дано Я открываю основную форму справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СхемыОбеспечения" 

	Дано Я открываю основную форму списка справочника "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СхемыОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СхемыОбеспечения"

	Дано Я открываю основную форму справочника "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СхемыОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииТоварногоПланирования" 

	Дано Я открываю основную форму списка справочника "СценарииТоварногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииТоварногоПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииТоварногоПланирования"

	Дано Я открываю основную форму справочника "СценарииТоварногоПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииТоварногоПланирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплатуКлиентуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетНаОплатуКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетНаОплатуКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплатуКлиентуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетНаОплатуКлиентуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетНаОплатуКлиентуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйАвансПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураВыданныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйАвансПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураВыданныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураВыданныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураВыданныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураВыданныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомиссионеруПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураКомиссионеруПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомиссионеруПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомиссионеруПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураКомиссионеруПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомиссионеруПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомитентаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураКомитентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомитентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомитентаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураКомитентаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураКомитентаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйАвансПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйАвансПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйАвансПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйАвансПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СчетФактураПолученныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СчетФактураПолученныйПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СчетФактураПолученныйПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТаможеннаяДекларацияИмпортПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипоразмерыУпаковок" 

	Дано Я открываю основную форму списка справочника "ТипоразмерыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипоразмерыУпаковок"

	Дано Я открываю основную форму справочника "ТипоразмерыУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипоразмерыЯчеек" 

	Дано Я открываю основную форму списка справочника "ТипоразмерыЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипоразмерыЯчеек"

	Дано Я открываю основную форму справочника "ТипоразмерыЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипоразмерыЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыИнформацииИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыИнформацииИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыПисемОбменСБанками" 

	Дано Я открываю основную форму списка справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыПисемОбменСБанками"

	Дано Я открываю основную форму справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыСобытийСПАРКРиски" 

	Дано Я открываю основную форму списка справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыСобытийСПАРКРиски"

	Дано Я открываю основную форму справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыТранспортныхСредств" 

	Дано Я открываю основную форму списка справочника "ТипыТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыТранспортныхСредств"

	Дано Я открываю основную форму справочника "ТипыТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеКатегории" 

	Дано Я открываю основную форму списка справочника "ТоварныеКатегории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварныеКатегории"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеКатегории"

	Дано Я открываю основную форму справочника "ТоварныеКатегории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварныеКатегории"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортнаяНакладнаяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТранспортнаяНакладнаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортнаяНакладнаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортнаяНакладнаяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТранспортнаяНакладнаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортнаяНакладнаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныеСредства" 

	Дано Я открываю основную форму списка справочника "ТранспортныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныеСредства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныеСредства"

	Дано Я открываю основную форму справочника "ТранспортныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТранспортныеСредства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОбъектовЕГАИС" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОбъектовЕГАИС"

	Дано Я открываю основную форму справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиЯндексКассы" 

	Дано Я открываю основную форму списка справочника "УдалитьНастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНастройкиЯндексКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиЯндексКассы"

	Дано Я открываю основную форму справочника "УдалитьНастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНастройкиЯндексКассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПрофилиНастроекЭДО" 

	Дано Я открываю основную форму списка справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПрофилиНастроекЭДО"

	Дано Я открываю основную форму справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСертификатыЭП" 

	Дано Я открываю основную форму списка справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСертификатыЭП"

	Дано Я открываю основную форму справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоглашенияОбИспользованииЭД" 

	Дано Я открываю основную форму списка справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоглашенияОбИспользованииЭД"

	Дано Я открываю основную форму справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковкиВЕТИС" 

	Дано Я открываю основную форму списка справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковкиВЕТИС"

	Дано Я открываю основную форму справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковкиЕдиницыИзмерения" 

	Дано Я открываю основную форму списка справочника "УпаковкиЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиЕдиницыИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковкиЕдиницыИзмерения"

	Дано Я открываю основную форму справочника "УпаковкиЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиЕдиницыИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОбслуживанияПартнеровТорговымиПредставителями" 

	Дано Я открываю основную форму списка справочника "УсловияОбслуживанияПартнеровТорговымиПредставителями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияОбслуживанияПартнеровТорговымиПредставителями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОбслуживанияПартнеровТорговымиПредставителями"

	Дано Я открываю основную форму справочника "УсловияОбслуживанияПартнеровТорговымиПредставителями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияОбслуживанияПартнеровТорговымиПредставителями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияПредоставленияСкидокНаценок" 

	Дано Я открываю основную форму списка справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияПредоставленияСкидокНаценок"

	Дано Я открываю основную форму справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияРегионализацииВЕТИС" 

	Дано Я открываю основную форму списка справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияРегионализацииВЕТИС"

	Дано Я открываю основную форму справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиСервиса" 

	Дано Я открываю основную форму списка справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиСервиса"

	Дано Я открываю основную форму справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатурыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатурыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УстановкаЦенНоменклатурыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеПолитикиОрганизаций" 

	Дано Я открываю основную форму списка справочника "УчетныеПолитикиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеПолитикиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеПолитикиОрганизаций"

	Дано Я открываю основную форму справочника "УчетныеПолитикиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеПолитикиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛица"

	Дано Я открываю основную форму справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыМагазинов" 

	Дано Я открываю основную форму списка справочника "ФорматыМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФорматыМагазинов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыМагазинов"

	Дано Я открываю основную форму справочника "ФорматыМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФорматыМагазинов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХарактеристикиНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХарактеристикиНоменклатуры"

	Дано Я открываю основную форму справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХозяйствующиеСубъектыВЕТИС" 

	Дано Я открываю основную форму списка справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХозяйствующиеСубъектыВЕТИС"

	Дано Я открываю основную форму справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелиВЕТИС"

	Дано Я открываю основную форму справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеновыеГруппы" 

	Дано Я открываю основную форму списка справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеновыеГруппы"

	Дано Я открываю основную форму справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныМагнитныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныМагнитныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЭтикетокИЦенников" 

	Дано Я открываю основную форму списка справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭтикетокИЦенников"

	Дано Я открываю основную форму справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтрихкодыУпаковокТоваров" 

	Дано Я открываю основную форму списка справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтрихкодыУпаковокТоваров"

	Дано Я открываю основную форму справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭДПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭДПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭДПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭДПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭДПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭквайринговыеТерминалы" 

	Дано Я открываю основную форму списка справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭквайринговыеТерминалы"

	Дано Я открываю основную форму справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхРабот" 

	Дано Я открываю основную форму списка документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхРабот"

	Дано Я открываю основную форму документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеОтгрузки" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеОтгрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеОтгрузки"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеОтгрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПеремещения" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеПеремещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПеремещения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПеремещения"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеПеремещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПеремещения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктОРасхожденияхПослеПриемки" 

	Дано Я открываю основную форму списка документа "АктОРасхожденияхПослеПриемки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПриемки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктОРасхожденияхПослеПриемки"

	Дано Я открываю основную форму документа "АктОРасхожденияхПослеПриемки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктОРасхожденияхПослеПриемки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПостановкиНаБалансЕГАИС" 

	Дано Я открываю основную форму списка документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПостановкиНаБалансЕГАИС"

	Дано Я открываю основную форму документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктСписанияЕГАИС" 

	Дано Я открываю основную форму списка документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктСписанияЕГАИС"

	Дано Я открываю основную форму документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АннулированиеПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "АннулированиеПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АннулированиеПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АннулированиеПодарочныхСертификатов"

	Дано Я открываю основную форму документа "АннулированиеПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АннулированиеПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкаВычетаНДС" 

	Дано Я открываю основную форму списка документа "БлокировкаВычетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БлокировкаВычетаНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкаВычетаНДС"

	Дано Я открываю основную форму документа "БлокировкаВычетаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БлокировкаВычетаНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатков" 

	Дано Я открываю основную форму списка документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатков"

	Дано Я открываю основную форму документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозачетЗадолженности" 

	Дано Я открываю основную форму списка документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозачетЗадолженности"

	Дано Я открываю основную форму документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнесениеДенежныхСредствВКассуККМ" 

	Дано Я открываю основную форму списка документа "ВнесениеДенежныхСредствВКассуККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеДенежныхСредствВКассуККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнесениеДенежныхСредствВКассуККМ"

	Дано Я открываю основную форму документа "ВнесениеДенежныхСредствВКассуККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеДенежныхСредствВКассуККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнутреннееПотреблениеТоваров" 

	Дано Я открываю основную форму списка документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнутреннееПотреблениеТоваров"

	Дано Я открываю основную форму документа "ВнутреннееПотреблениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнутреннееПотреблениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзРегистра2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзРегистра2ЕГАИС"

	Дано Я открываю основную форму документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "ВозвратПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратПодарочныхСертификатов"

	Дано Я открываю основную форму документа "ВозвратПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровМеждуОрганизациями"

	Дано Я открываю основную форму документа "ВозвратТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровОтКлиента" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровОтКлиента"

	Дано Я открываю основную форму документа "ВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратТоваровПоставщику" 

	Дано Я открываю основную форму списка документа "ВозвратТоваровПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратТоваровПоставщику"

	Дано Я открываю основную форму документа "ВозвратТоваровПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратТоваровПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыводИзОборотаИСМП" 

	Дано Я открываю основную форму списка документа "ВыводИзОборотаИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыводИзОборотаИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыводИзОборотаИСМП"

	Дано Я открываю основную форму документа "ВыводИзОборотаИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыводИзОборотаИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыемкаДенежныхСредствИзКассыККМ" 

	Дано Я открываю основную форму списка документа "ВыемкаДенежныхСредствИзКассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаДенежныхСредствИзКассыККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыемкаДенежныхСредствИзКассыККМ"

	Дано Я открываю основную форму документа "ВыемкаДенежныхСредствИзКассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаДенежныхСредствИзКассыККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыКлиентом" 

	Дано Я открываю основную форму списка документа "ВыкупВозвратнойТарыКлиентом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыКлиентом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыКлиентом"

	Дано Я открываю основную форму документа "ВыкупВозвратнойТарыКлиентом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыКлиентом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыкупВозвратнойТарыУПоставщика" 

	Дано Я открываю основную форму списка документа "ВыкупВозвратнойТарыУПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыУПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыкупВозвратнойТарыУПоставщика"

	Дано Я открываю основную форму документа "ВыкупВозвратнойТарыУПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыкупВозвратнойТарыУПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикИсполненияДоговора" 

	Дано Я открываю основную форму списка документа "ГрафикИсполненияДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикИсполненияДоговора"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикИсполненияДоговора"

	Дано Я открываю основную форму документа "ГрафикИсполненияДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикИсполненияДоговора"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвижениеПрочихАктивовПассивов" 

	Дано Я открываю основную форму списка документа "ДвижениеПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПрочихАктивовПассивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвижениеПрочихАктивовПассивов"

	Дано Я открываю основную форму документа "ДвижениеПрочихАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДвижениеПрочихАктивовПассивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоверенностьВыданная" 

	Дано Я открываю основную форму списка документа "ДоверенностьВыданная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоверенностьВыданная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоверенностьВыданная"

	Дано Я открываю основную форму документа "ДоверенностьВыданная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоверенностьВыданная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеНаПеревозку" 

	Дано Я открываю основную форму списка документа "ЗаданиеНаПеревозку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаПеревозку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеНаПеревозку"

	Дано Я открываю основную форму документа "ЗаданиеНаПеревозку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаПеревозку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеТорговомуПредставителю" 

	Дано Я открываю основную форму списка документа "ЗаданиеТорговомуПредставителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеТорговомуПредставителю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеТорговомуПредставителю"

	Дано Я открываю основную форму документа "ЗаданиеТорговомуПредставителю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеТорговомуПредставителю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказКлиента" 

	Дано Я открываю основную форму списка документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказКлиента"

	Дано Я открываю основную форму документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотребление"

	Дано Я открываю основную форму документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПеремещение" 

	Дано Я открываю основную форму списка документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПеремещение"

	Дано Я открываю основную форму документа "ЗаказНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаСборку" 

	Дано Я открываю основную форму списка документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаСборку"

	Дано Я открываю основную форму документа "ЗаказНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаСборку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" 

	Дано Я открываю основную форму списка документа "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"

	Дано Я открываю основную форму документа "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаЭмиссиюКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщику" 

	Дано Я открываю основную форму списка документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщику"

	Дано Я открываю основную форму документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписьКнигиПокупок" 

	Дано Я открываю основную форму списка документа "ЗаписьКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПокупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписьКнигиПокупок"

	Дано Я открываю основную форму документа "ЗаписьКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПокупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписьКнигиПродаж" 

	Дано Я открываю основную форму списка документа "ЗаписьКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписьКнигиПродаж"

	Дано Я открываю основную форму документа "ЗаписьКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписьКнигиПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросАкцизныхМарокЕГАИС" 

	Дано Я открываю основную форму списка документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческихПредложенийПоставщиков" 

	Дано Я открываю основную форму списка документа "ЗапросКоммерческихПредложенийПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческихПредложенийПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческихПредложенийПоставщиков"

	Дано Я открываю основную форму документа "ЗапросКоммерческихПредложенийПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческихПредложенийПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросКоммерческогоПредложенияОтКлиента" 

	Дано Я открываю основную форму списка документа "ЗапросКоммерческогоПредложенияОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческогоПредложенияОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросКоммерческогоПредложенияОтКлиента"

	Дано Я открываю основную форму документа "ЗапросКоммерческогоПредложенияОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросКоммерческогоПредложенияОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВозвратТоваровОтКлиента" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму документа "ЗаявкаНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВыпускКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВыпускКиЗГИСМ"

	Дано Я открываю основную форму документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОВвозеТоваров" 

	Дано Я открываю основную форму списка документа "ЗаявлениеОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОВвозеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОВвозеТоваров"

	Дано Я открываю основную форму документа "ЗаявлениеОВвозеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОВвозеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеАссортимента" 

	Дано Я открываю основную форму списка документа "ИзменениеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеАссортимента"

	Дано Я открываю основную форму документа "ИзменениеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризационнаяОпись" 

	Дано Я открываю основную форму списка документа "ИнвентаризационнаяОпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризационнаяОпись"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризационнаяОпись"

	Дано Я открываю основную форму документа "ИнвентаризационнаяОпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризационнаяОпись"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияНаличныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияНаличныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНаличныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияНаличныхДенежныхСредств"

	Дано Я открываю основную форму документа "ИнвентаризацияНаличныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияНаличныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияПродукцииВЕТИС" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияПродукцииВЕТИС"

	Дано Я открываю основную форму документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнойДокументПодтвержденияНДС" 

	Дано Я открываю основную форму списка документа "ИнойДокументПодтвержденияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнойДокументПодтвержденияНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнойДокументПодтвержденияНДС"

	Дано Я открываю основную форму документа "ИнойДокументПодтвержденияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнойДокументПодтвержденияНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсправлениеРазвернутогоСальдоТоваровОрганизаций" 

	Дано Я открываю основную форму списка документа "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"

	Дано Я открываю основную форму документа "ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсправлениеРазвернутогоСальдоТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассоваяСмена" 

	Дано Я открываю основную форму списка документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассоваяСмена"

	Дано Я открываю основную форму документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеКлиенту" 

	Дано Я открываю основную форму списка документа "КоммерческоеПредложениеКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеКлиенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеКлиенту"

	Дано Я открываю основную форму документа "КоммерческоеПредложениеКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеКлиенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческоеПредложениеПоставщика" 

	Дано Я открываю основную форму списка документа "КоммерческоеПредложениеПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческоеПредложениеПоставщика"

	Дано Я открываю основную форму документа "КоммерческоеПредложениеПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КоммерческоеПредложениеПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаВидаДеятельностиНДС" 

	Дано Я открываю основную форму списка документа "КорректировкаВидаДеятельностиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаВидаДеятельностиНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаВидаДеятельностиНДС"

	Дано Я открываю основную форму документа "КорректировкаВидаДеятельностиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаВидаДеятельностиНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаЗадолженностиПоФинансовымИнструментам" 

	Дано Я открываю основную форму списка документа "КорректировкаЗадолженностиПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженностиПоФинансовымИнструментам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаЗадолженностиПоФинансовымИнструментам"

	Дано Я открываю основную форму документа "КорректировкаЗадолженностиПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗадолженностиПоФинансовымИнструментам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаИзлишковНедостачПоТоварнымМестам" 

	Дано Я открываю основную форму списка документа "КорректировкаИзлишковНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаИзлишковНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаИзлишковНедостачПоТоварнымМестам"

	Дано Я открываю основную форму документа "КорректировкаИзлишковНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаИзлишковНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНазначенияТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНазначенияТоваров"

	Дано Я открываю основную форму документа "КорректировкаНазначенияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНазначенияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаНалогообложенияНДСПартийТоваров" 

	Дано Я открываю основную форму списка документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаНалогообложенияНДСПартийТоваров"

	Дано Я открываю основную форму документа "КорректировкаНалогообложенияНДСПартийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаНалогообложенияНДСПартийТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаОбособленногоУчетаЗапасов" 

	Дано Я открываю основную форму списка документа "КорректировкаОбособленногоУчетаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаОбособленногоУчетаЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаОбособленногоУчетаЗапасов"

	Дано Я открываю основную форму документа "КорректировкаОбособленногоУчетаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаОбособленногоУчетаЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПоОрдеруНаТовары" 

	Дано Я открываю основную форму списка документа "КорректировкаПоОрдеруНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоОрдеруНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПоОрдеруНаТовары"

	Дано Я открываю основную форму документа "КорректировкаПоОрдеруНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоОрдеруНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПриобретения" 

	Дано Я открываю основную форму списка документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПриобретения"

	Дано Я открываю основную форму документа "КорректировкаПриобретения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПриобретения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРеализации" 

	Дано Я открываю основную форму списка документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРеализации"

	Дано Я открываю основную форму документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитыРасходаДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму документа "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛистКассовойКниги" 

	Дано Я открываю основную форму списка документа "ЛистКассовойКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистКассовойКниги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛистКассовойКниги"

	Дано Я открываю основную форму документа "ЛистКассовойКниги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистКассовойКниги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркировкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "МаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркировкаТоваровИСМП"

	Дано Я открываю основную форму документа "МаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеИСписаниеБонусныхБаллов" 

	Дано Я открываю основную форму списка документа "НачислениеИСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеИСписаниеБонусныхБаллов"

	Дано Я открываю основную форму документа "НачислениеИСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияКредитовИДепозитов" 

	Дано Я открываю основную форму списка документа "НачисленияКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияКредитовИДепозитов"

	Дано Я открываю основную форму документа "НачисленияКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативРаспределенияПлановПродажПоКатегориям" 

	Дано Я открываю основную форму списка документа "НормативРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НормативРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативРаспределенияПлановПродажПоКатегориям"

	Дано Я открываю основную форму документа "НормативРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НормативРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОжидаемоеПоступлениеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ОжидаемоеПоступлениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОжидаемоеПоступлениеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОжидаемоеПоступлениеДенежныхСредств"

	Дано Я открываю основную форму документа "ОжидаемоеПоступлениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОжидаемоеПоступлениеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоПлатежнойКарте" 

	Дано Я открываю основную форму списка документа "ОперацияПоПлатежнойКарте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнойКарте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоПлатежнойКарте"

	Дано Я открываю основную форму документа "ОперацияПоПлатежнойКарте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнойКарте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоЯндексКассе" 

	Дано Я открываю основную форму списка документа "ОперацияПоЯндексКассе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоЯндексКассе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоЯндексКассе"

	Дано Я открываю основную форму документа "ОперацияПоЯндексКассе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоЯндексКассе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОприходованиеИзлишковТоваров" 

	Дано Я открываю основную форму списка документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОприходованиеИзлишковТоваров"

	Дано Я открываю основную форму документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеИзлишковТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеИзлишковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеИзлишковТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеИзлишковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеНедостачТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеНедостачТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеНедостачТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеНедостачТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеПересортицыТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеПересортицыТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПересортицыТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеПересортицыТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеПересортицыТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПересортицыТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаОтражениеПорчиТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаОтражениеПорчиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПорчиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаОтражениеПорчиТоваров"

	Дано Я открываю основную форму документа "ОрдерНаОтражениеПорчиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаОтражениеПорчиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрдерНаПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ОрдерНаПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрдерНаПеремещениеТоваров"

	Дано Я открываю основную форму документа "ОрдерНаПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОрдерНаПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиЕГАИС" 

	Дано Я открываю основную форму списка документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиЕГАИС"

	Дано Я открываю основную форму документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборРазмещениеТоваров" 

	Дано Я открываю основную форму списка документа "ОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтборРазмещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборРазмещениеТоваров"

	Дано Я открываю основную форму документа "ОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтборРазмещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеРасхожденийПриИнкассацииДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"

	Дано Я открываю основную форму документа "ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеРасхожденийПриИнкассацииДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетБанкаПоОперациямЭквайринга" 

	Дано Я открываю основную форму списка документа "ОтчетБанкаПоОперациямЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетБанкаПоОперациямЭквайринга"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетБанкаПоОперациямЭквайринга"

	Дано Я открываю основную форму документа "ОтчетБанкаПоОперациямЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетБанкаПоОперациямЭквайринга"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетЕГАИС" 

	Дано Я открываю основную форму списка документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетЕГАИС"

	Дано Я открываю основную форму документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионера" 

	Дано Я открываю основную форму списка документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионера"

	Дано Я открываю основную форму документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионераОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетКомиссионераОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионераОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионераОСписании"

	Дано Я открываю основную форму документа "ОтчетКомиссионераОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионераОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитенту" 

	Дано Я открываю основную форму списка документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитенту"

	Дано Я открываю основную форму документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитентуОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетКомитентуОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитентуОСписании"

	Дано Я открываю основную форму документа "ОтчетКомитентуОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитентуОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхПродажах" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхПродажах"

	Дано Я открываю основную форму документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПоКомиссииМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ОтчетПоКомиссииМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПоКомиссииМеждуОрганизациями"

	Дано Я открываю основную форму документа "ОтчетПоКомиссииМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПоКомиссииМеждуОрганизациямиОСписании" 

	Дано Я открываю основную форму списка документа "ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПоКомиссииМеждуОрганизациямиОСписании"

	Дано Я открываю основную форму документа "ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПоКомиссииМеждуОрганизациямиОСписании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанками"

	Дано Я открываю основную форму документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетЭД" 

	Дано Я открываю основную форму списка документа "ПакетЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетЭД"

	Дано Я открываю основную форму документа "ПакетЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПервичныйДокумент" 

	Дано Я открываю основную форму списка документа "ПервичныйДокумент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПервичныйДокумент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПервичныйДокумент"

	Дано Я открываю основную форму документа "ПервичныйДокумент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПервичныйДокумент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВРегистр2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВРегистр2ЕГАИС"

	Дано Я открываю основную форму документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка документа "ПередачаТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаТоваровМеждуОрганизациями"

	Дано Я открываю основную форму документа "ПередачаТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремаркировкаТоваровИСМП" 

	Дано Я открываю основную форму списка документа "ПеремаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремаркировкаТоваровИСМП"

	Дано Я открываю основную форму документа "ПеремаркировкаТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеТоваров"

	Дано Я открываю основную форму документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПересортицаТоваров" 

	Дано Я открываю основную форму списка документа "ПересортицаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПересортицаТоваров"

	Дано Я открываю основную форму документа "ПересортицаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПересчетТоваров" 

	Дано Я открываю основную форму списка документа "ПересчетТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересчетТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПересчетТоваров"

	Дано Я открываю основную форму документа "ПересчетТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересчетТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПисьмоОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПисьмоОбменСБанками"

	Дано Я открываю основную форму документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланЗакупок" 

	Дано Я открываю основную форму списка документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланЗакупок"

	Дано Я открываю основную форму документа "ПланЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОстатков" 

	Дано Я открываю основную форму списка документа "ПланОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОстатков"

	Дано Я открываю основную форму документа "ПланОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродаж" 

	Дано Я открываю основную форму списка документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродаж"

	Дано Я открываю основную форму документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродажПоКатегориям" 

	Дано Я открываю основную форму списка документа "ПланПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродажПоКатегориям"

	Дано Я открываю основную форму документа "ПланПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланСборкиРазборки" 

	Дано Я открываю основную форму списка документа "ПланСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланСборкиРазборки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланСборкиРазборки"

	Дано Я открываю основную форму документа "ПланСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланСборкиРазборки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоручениеЭкспедитору" 

	Дано Я открываю основную форму списка документа "ПоручениеЭкспедитору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоручениеЭкспедитору"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоручениеЭкспедитору"

	Дано Я открываю основную форму документа "ПоручениеЭкспедитору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоручениеЭкспедитору"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорчаТоваров" 

	Дано Я открываю основную форму списка документа "ПорчаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПорчаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорчаТоваров"

	Дано Я открываю основную форму документа "ПорчаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПорчаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "ПоступлениеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровНаСклад" 

	Дано Я открываю основную форму списка документа "ПоступлениеТоваровНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровНаСклад"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровНаСклад"

	Дано Я открываю основную форму документа "ПоступлениеТоваровНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровНаСклад"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеТоваровУслуг" 

	Дано Я открываю основную форму списка документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеТоваровУслуг"

	Дано Я открываю основную форму документа "ПриобретениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриобретениеУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриобретениеУслугПрочихАктивов"

	Дано Я открываю основную форму документа "ПриобретениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриобретениеУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйОрдерНаТовары" 

	Дано Я открываю основную форму списка документа "ПриходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдерНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйОрдерНаТовары"

	Дано Я открываю основную форму документа "ПриходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдерНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочееОприходованиеТоваров" 

	Дано Я открываю основную форму списка документа "ПрочееОприходованиеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочееОприходованиеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочееОприходованиеТоваров"

	Дано Я открываю основную форму документа "ПрочееОприходованиеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочееОприходованиеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходыРасходы" 

	Дано Я открываю основную форму списка документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходыРасходы"

	Дано Я открываю основную форму документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспоряжениеНаПеремещениеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "РаспоряжениеНаПеремещениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспоряжениеНаПеремещениеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспоряжениеНаПеремещениеДенежныхСредств"

	Дано Я открываю основную форму документа "РаспоряжениеНаПеремещениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспоряжениеНаПеремещениеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеДоходовПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеДоходовПоНаправлениямДеятельности"

	Дано Я открываю основную форму документа "РаспределениеДоходовПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеДоходовПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеНДС" 

	Дано Я открываю основную форму списка документа "РаспределениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеНДС"

	Дано Я открываю основную форму документа "РаспределениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПрочихЗатрат" 

	Дано Я открываю основную форму списка документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПрочихЗатрат"

	Дано Я открываю основную форму документа "РаспределениеПрочихЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеПрочихЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеРасходовБудущихПериодов" 

	Дано Я открываю основную форму списка документа "РаспределениеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеРасходовБудущихПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеРасходовБудущихПериодов"

	Дано Я открываю основную форму документа "РаспределениеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеРасходовБудущихПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкаКлиентам" 

	Дано Я открываю основную форму списка документа "РассылкаКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РассылкаКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкаКлиентам"

	Дано Я открываю основную форму документа "РассылкаКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РассылкаКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйОрдерНаТовары" 

	Дано Я открываю основную форму списка документа "РасходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдерНаТовары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйОрдерНаТовары"

	Дано Я открываю основную форму документа "РасходныйОрдерНаТовары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдерНаТовары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетКурсовыхРазниц" 

	Дано Я открываю основную форму списка документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетКурсовыхРазниц"

	Дано Я открываю основную форму документа "РасчетКурсовыхРазниц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетКурсовыхРазниц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСебестоимостиТоваров" 

	Дано Я открываю основную форму списка документа "РасчетСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСебестоимостиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСебестоимостиТоваров"

	Дано Я открываю основную форму документа "РасчетСебестоимостиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСебестоимостиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "РеализацияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияПодарочныхСертификатов"

	Дано Я открываю основную форму документа "РеализацияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияТоваровУслуг" 

	Дано Я открываю основную форму списка документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияТоваровУслуг"

	Дано Я открываю основную форму документа "РеализацияТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеализацияУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "РеализацияУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеализацияУслугПрочихАктивов"

	Дано Я открываю основную форму документа "РеализацияУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеализацияУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистраторГрафикаДвиженияТоваров" 

	Дано Я открываю основную форму списка документа "РегистраторГрафикаДвиженияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторГрафикаДвиженияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистраторГрафикаДвиженияТоваров"

	Дано Я открываю основную форму документа "РегистраторГрафикаДвиженияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторГрафикаДвиженияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистраторРасчетов" 

	Дано Я открываю основную форму списка документа "РегистраторРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистраторРасчетов"

	Дано Я открываю основную форму документа "РегистраторРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистраторРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияЦенНоменклатурыПоставщика" 

	Дано Я открываю основную форму списка документа "РегистрацияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияЦенНоменклатурыПоставщика"

	Дано Я открываю основную форму документа "РегистрацияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборкаТоваров" 

	Дано Я открываю основную форму списка документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборкаТоваров"

	Дано Я открываю основную форму документа "СборкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетов"

	Дано Я открываю основную форму документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаНачальныхОстатковПоСкладу" 

	Дано Я открываю основную форму списка документа "СверкаНачальныхОстатковПоСкладу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаНачальныхОстатковПоСкладу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаНачальныхОстатковПоСкладу"

	Дано Я открываю основную форму документа "СверкаНачальныхОстатковПоСкладу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаНачальныхОстатковПоСкладу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СводнаяСправкаНДС" 

	Дано Я открываю основную форму списка документа "СводнаяСправкаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СводнаяСправкаНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СводнаяСправкаНДС"

	Дано Я открываю основную форму документа "СводнаяСправкаНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СводнаяСправкаНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанками" 

	Дано Я открываю основную форму списка документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанками"

	Дано Я открываю основную форму документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБезналичныхДенежныхСредств" 

	Дано Я открываю основную форму списка документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБезналичныхДенежныхСредств"

	Дано Я открываю основную форму документа "СписаниеБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБезналичныхДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗадолженности" 

	Дано Я открываю основную форму списка документа "СписаниеЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗадолженности"

	Дано Я открываю основную форму документа "СписаниеЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеКодовМаркировкиИСМП" 

	Дано Я открываю основную форму списка документа "СписаниеКодовМаркировкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеКодовМаркировкиИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеКодовМаркировкиИСМП"

	Дано Я открываю основную форму документа "СписаниеКодовМаркировкиИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеКодовМаркировкиИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНДСНаРасходы" 

	Дано Я открываю основную форму списка документа "СписаниеНДСНаРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНДСНаРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНДСНаРасходы"

	Дано Я открываю основную форму документа "СписаниеНДСНаРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНДСНаРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеНедостачТоваров" 

	Дано Я открываю основную форму списка документа "СписаниеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНедостачТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеНедостачТоваров"

	Дано Я открываю основную форму документа "СписаниеНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеНедостачТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаОПодтверждающихДокументах" 

	Дано Я открываю основную форму списка документа "СправкаОПодтверждающихДокументах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаОПодтверждающихДокументах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаОПодтверждающихДокументах"

	Дано Я открываю основную форму документа "СправкаОПодтверждающихДокументах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаОПодтверждающихДокументах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиСПАРКРиски" 

	Дано Я открываю основную форму списка документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиСПАРКРиски"

	Дано Я открываю основную форму документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплатуКлиенту" 

	Дано Я открываю основную форму списка документа "СчетНаОплатуКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуКлиенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплатуКлиенту"

	Дано Я открываю основную форму документа "СчетНаОплатуКлиенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуКлиенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданный" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданный"

	Дано Я открываю основную форму документа "СчетФактураВыданный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураВыданныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураВыданныйАванс"

	Дано Я открываю основную форму документа "СчетФактураВыданныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураВыданныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомиссионеру" 

	Дано Я открываю основную форму списка документа "СчетФактураКомиссионеру"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомиссионеру"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомиссионеру"

	Дано Я открываю основную форму документа "СчетФактураКомиссионеру"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомиссионеру"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураКомитента" 

	Дано Я открываю основную форму списка документа "СчетФактураКомитента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомитента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураКомитента"

	Дано Я открываю основную форму документа "СчетФактураКомитента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураКомитента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураНалоговыйАгент" 

	Дано Я открываю основную форму списка документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураНалоговыйАгент"

	Дано Я открываю основную форму документа "СчетФактураНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНалоговыйАгент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураНаНеподтвержденнуюРеализацию0" 

	Дано Я открываю основную форму списка документа "СчетФактураНаНеподтвержденнуюРеализацию0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНаНеподтвержденнуюРеализацию0"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураНаНеподтвержденнуюРеализацию0"

	Дано Я открываю основную форму документа "СчетФактураНаНеподтвержденнуюРеализацию0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураНаНеподтвержденнуюРеализацию0"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученный" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученный"

	Дано Я открываю основную форму документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйАванс" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйАванс"

	Дано Я открываю основную форму документа "СчетФактураПолученныйАванс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйАванс"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученныйНалоговыйАгент" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученныйНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйНалоговыйАгент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученныйНалоговыйАгент"

	Дано Я открываю основную форму документа "СчетФактураПолученныйНалоговыйАгент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученныйНалоговыйАгент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаможеннаяДекларацияИмпорт" 

	Дано Я открываю основную форму списка документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаможеннаяДекларацияИмпорт"

	Дано Я открываю основную форму документа "ТаможеннаяДекларацияИмпорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТаможеннаяДекларацияИмпорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортнаяНакладная" 

	Дано Я открываю основную форму списка документа "ТранспортнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортнаяНакладная"

	Дано Я открываю основную форму документа "ТранспортнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортнаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНВходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНВходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНИсходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНИсходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбИмпортеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОЗачисленииВалюты" 

	Дано Я открываю основную форму списка документа "УведомлениеОЗачисленииВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОЗачисленииВалюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОЗачисленииВалюты"

	Дано Я открываю основную форму документа "УведомлениеОЗачисленииВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОЗачисленииВалюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПоступленииМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПоступленииМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСписанииКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСписанииКиЗГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКассоваяСмена" 

	Дано Я открываю основную форму списка документа "УдалитьКассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКассоваяСмена"

	Дано Я открываю основную форму документа "УдалитьКассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКассовыйЧекКоррекции" 

	Дано Я открываю основную форму списка документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКассовыйЧекКоррекции"

	Дано Я открываю основную форму документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПроизвольныйЭД" 

	Дано Я открываю основную форму списка документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПроизвольныйЭД"

	Дано Я открываю основную форму документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковочныйЛист" 

	Дано Я открываю основную форму списка документа "УпаковочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УпаковочныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковочныйЛист"

	Дано Я открываю основную форму документа "УпаковочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УпаковочныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаБлокировокЯчеек" 

	Дано Я открываю основную форму списка документа "УстановкаБлокировокЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаБлокировокЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаБлокировокЯчеек"

	Дано Я открываю основную форму документа "УстановкаБлокировокЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаБлокировокЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаКвотАссортимента" 

	Дано Я открываю основную форму списка документа "УстановкаКвотАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКвотАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаКвотАссортимента"

	Дано Я открываю основную форму документа "УстановкаКвотАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКвотАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатуры" 

	Дано Я открываю основную форму списка документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатуры"

	Дано Я открываю основную форму документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИС" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИС"

	Дано Я открываю основную форму документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИСВозврат" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИСВозврат"

	Дано Я открываю основную форму документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМ" 

	Дано Я открываю основную форму списка документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМ"

	Дано Я открываю основную форму документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМВозврат" 

	Дано Я открываю основную форму списка документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМВозврат"

	Дано Я открываю основную форму документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМКоррекции" 

	Дано Я открываю основную форму списка документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМКоррекции"

	Дано Я открываю основную форму документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументВходящий" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументВходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументВходящий"

	Дано Я открываю основную форму документа "ЭлектронныйДокументВходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументИсходящий" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументИсходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументИсходящий"

	Дано Я открываю основную форму документа "ЭлектронныйДокументИсходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ABCXYZАнализНоменклатуры"

	Дано Я открываю основную форму отчета "ABCXYZАнализНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCXYZАнализНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ABCXYZРаспределениеКлиентов"

	Дано Я открываю основную форму отчета "ABCXYZРаспределениеКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCXYZРаспределениеКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализДоходовРасходов"

	Дано Я открываю основную форму отчета "АнализДоходовРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализДоходовРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗависимостиОтКлиентовABC"

	Дано Я открываю основную форму отчета "АнализЗависимостиОтКлиентовABC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗависимостиОтКлиентовABC"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализИсполненияАссортимента"

	Дано Я открываю основную форму отчета "АнализИсполненияАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализИсполненияАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализКлиентскойБазыBCG"

	Дано Я открываю основную форму отчета "АнализКлиентскойБазыBCG"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализКлиентскойБазыBCG"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЛояльностиКлиентовXYZ"

	Дано Я открываю основную форму отчета "АнализЛояльностиКлиентовXYZ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЛояльностиКлиентовXYZ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОстатковТоваровОрганизаций"

	Дано Я открываю основную форму отчета "АнализОстатковТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОстатковТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПервичногоИнтереса"

	Дано Я открываю основную форму отчета "АнализПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПервичногоИнтереса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПервичногоСпроса"

	Дано Я открываю основную форму отчета "АнализПервичногоСпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПервичногоСпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПретензийКлиентов"

	Дано Я открываю основную форму отчета "АнализПретензийКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПретензийКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовКлиентов"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовПоставщикам"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинОтменыЗаказовПоставщикамПоДокументу"

	Дано Я открываю основную форму отчета "АнализПричинОтменыЗаказовПоставщикамПоДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинОтменыЗаказовПоставщикамПоДокументу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПричинПроигрышаСделок"

	Дано Я открываю основную форму отчета "АнализПричинПроигрышаСделок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПричинПроигрышаСделок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРаспределенияНДС"

	Дано Я открываю основную форму отчета "АнализРаспределенияНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРаспределенияНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриИнвентаризацииПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСебестоимостиТоваровРасширенный"

	Дано Я открываю основную форму отчета "АнализСебестоимостиТоваровРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСебестоимостиТоваровРасширенный"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализФинансовыхРезультатов"

	Дано Я открываю основную форму отчета "АнализФинансовыхРезультатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализФинансовыхРезультатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЦенПоставщиков"

	Дано Я открываю основную форму отчета "АнализЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЦенПоставщиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЭффективностиРаботыТорговыхПредставителей"

	Дано Я открываю основную форму отчета "АнализЭффективностиРаботыТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЭффективностиРаботыТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БонусныеБаллы"

	Дано Я открываю основную форму отчета "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БонусныеБаллы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВаловаяПрибыльПоОплаченнымОтгрузкам"

	Дано Я открываю основную форму отчета "ВаловаяПрибыльПоОплаченнымОтгрузкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВаловаяПрибыльПоОплаченнымОтгрузкам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьБезналичныхДенежныхСредств"

	Дано Я открываю основную форму отчета "ВедомостьБезналичныхДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьБезналичныхДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДенежнымСредствам"

	Дано Я открываю основную форму отчета "ВедомостьПоДенежнымСредствам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДенежнымСредствам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"

	Дано Я открываю основную форму отчета "ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоДенежнымСредствамУПодотчетныхЛиц"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПартиямТоваров"

	Дано Я открываю основную форму отчета "ВедомостьПоПартиямТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПартиямТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПереданнойВозвратнойТаре"

	Дано Я открываю основную форму отчета "ВедомостьПоПереданнойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПереданнойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоПринятойВозвратнойТаре"

	Дано Я открываю основную форму отчета "ВедомостьПоПринятойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоПринятойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоСериямНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоСериямНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоСериямНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамНаСкладах"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамНаСкладах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамОрганизаций"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовМеждуОрганизациями"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовПоФинансовымИнструментам"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовПоФинансовымИнструментам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСПартнерами"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "ВедомостьРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВероятностныйПрогноз"

	Дано Я открываю основную форму отчета "ВероятностныйПрогноз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВероятностныйПрогноз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоронкаПродаж"

	Дано Я открываю основную форму отчета "ВоронкаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоронкаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеУсловийСоглашенийСКлиентами"

	Дано Я открываю основную форму отчета "ВыполнениеУсловийСоглашенийСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыполнениеУсловийСоглашенийСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьПродаж"

	Дано Я открываю основную форму отчета "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьРозничныхПродаж"

	Дано Я открываю основную форму отчета "ВыручкаИСебестоимостьРозничныхПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыручкаИСебестоимостьРозничныхПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеСерииНоменклатуры"

	Дано Я открываю основную форму отчета "ДвижениеСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДенежныхСредств"

	Дано Я открываю основную форму отчета "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияМеждуРегистрамиЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияМеждуРегистрамиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияМеждуРегистрамиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияПоСправке2ЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияПоСправке2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияПоСправке2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДебиторскаяЗадолженность"

	Дано Я открываю основную форму отчета "ДебиторскаяЗадолженность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДебиторскаяЗадолженность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДебиторскаяЗадолженностьДоляПросрочки"

	Дано Я открываю основную форму отчета "ДебиторскаяЗадолженностьДоляПросрочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДебиторскаяЗадолженностьДоляПросрочки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаСостоянияЭДО"

	Дано Я открываю основную форму отчета "ДиаграммаСостоянияЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаСостоянияЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаИзмененияЦенНоменклатуры"

	Дано Я открываю основную форму отчета "ДинамикаИзмененияЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаИзмененияЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаИзмененияЦенНоменклатурыПоставщика"

	Дано Я открываю основную форму отчета "ДинамикаИзмененияЦенНоменклатурыПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаИзмененияЦенНоменклатурыПоставщика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаПоказателейРаботыТорговыхПредставителей"

	Дано Я открываю основную форму отчета "ДинамикаПоказателейРаботыТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаПоказателейРаботыТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступностьВариантовАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму отчета "ДоступностьВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоступностьВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДосьеКонтрагента"

	Дано Я открываю основную форму отчета "ДосьеКонтрагента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДосьеКонтрагента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДосьеПартнера"

	Дано Я открываю основную форму отчета "ДосьеПартнера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДосьеПартнера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаРозничнойПродажиАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаСчетовФактур"

	Дано Я открываю основную форму отчета "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаТМЦСданныхНаХранение"

	Дано Я открываю основную форму отчета "ЖурналУчетаТМЦСданныхНаХранение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаТМЦСданныхНаХранение"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналФискальныхОпераций"

	Дано Я открываю основную форму отчета "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналФискальныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаблокированныеЯчейки"

	Дано Я открываю основную форму отчета "ЗаблокированныеЯчейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаблокированныеЯчейки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьКлиентов"

	Дано Я открываю основную форму отчета "ЗадолженностьКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьКлиентовПоСрокам"

	Дано Я открываю основную форму отчета "ЗадолженностьКлиентовПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьКлиентовПоСрокам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьПоставщикам"

	Дано Я открываю основную форму отчета "ЗадолженностьПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадолженностьПоставщикамПоСрокам"

	Дано Я открываю основную форму отчета "ЗадолженностьПоставщикамПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадолженностьПоставщикамПоСрокам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеСвойствПартнеров"

	Дано Я открываю основную форму отчета "ЗаполнениеСвойствПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаполнениеСвойствПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполненностьСклада"

	Дано Я открываю основную форму отчета "ЗаполненностьСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаполненностьСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИзменениеABCXYZРаспределенияКлиентов"

	Дано Я открываю основную форму отчета "ИзменениеABCXYZРаспределенияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИзменениеABCXYZРаспределенияКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИмпортныеТоварыКОформлению"

	Дано Я открываю основную форму отчета "ИмпортныеТоварыКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИмпортныеТоварыКОформлению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыСПАРКРиски"

	Дано Я открываю основную форму отчета "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыЦенНоменклатуры"

	Дано Я открываю основную форму отчета "ИндексыЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыЦенПоставщиков"

	Дано Я открываю основную форму отчета "ИндексыЦенПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыЦенПоставщиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияОбОрганизацииЕГАИС"

	Дано Я открываю основную форму отчета "ИнформацияОбОрганизацииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИнформацияОбОрганизацииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаЗакупок"

	Дано Я открываю основную форму отчета "ИсполнениеПланаЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаПродаж"

	Дано Я открываю основную форму отчета "ИсполнениеПланаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаСборкиРазборки"

	Дано Я открываю основную форму отчета "ИсполнениеПланаСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаСборкиРазборки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеРаспоряженийНаПеремещениеСборку"

	Дано Я открываю основную форму отчета "ИсполнениеРаспоряженийНаПеремещениеСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеРаспоряженийНаПеремещениеСборку"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсторияСправок2ЕГАИС"

	Дано Я открываю основную форму отчета "ИсторияСправок2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсторияСправок2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КалендарьСобытий"

	Дано Я открываю основную форму отчета "КалендарьСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КалендарьСобытий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаПродаж"

	Дано Я открываю основную форму отчета "КартаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КартаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаПартииПоВидамНалогообложения"

	Дано Я открываю основную форму отчета "КарточкаПартииПоВидамНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаПартииПоВидамНалогообложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовПоПереданнойВозвратнойТаре"

	Дано Я открываю основную форму отчета "КарточкаРасчетовПоПереданнойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовПоПереданнойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовПоПринятойВозвратнойТаре"

	Дано Я открываю основную форму отчета "КарточкаРасчетовПоПринятойВозвратнойТаре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовПоПринятойВозвратнойТаре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСКлиентами24"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСКлиентами24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСКлиентами24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаРасчетовСПоставщиками24"

	Дано Я открываю основную форму отчета "КарточкаРасчетовСПоставщиками24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаРасчетовСПоставщиками24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаПокупок"

	Дано Я открываю основную форму отчета "КнигаПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаПокупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаПродаж"

	Дано Я открываю основную форму отчета "КнигаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтактнаяИнформация"

	Дано Я открываю основную форму отчета "КонтактнаяИнформация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтактнаяИнформация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"

	Дано Я открываю основную форму отчета "КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольНомеровГТДТоваров"

	Дано Я открываю основную форму отчета "КонтрольНомеровГТДТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольНомеровГТДТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОперацийСДенежнымиСредствами"

	Дано Я открываю основную форму отчета "КонтрольОперацийСДенежнымиСредствами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОперацийСДенежнымиСредствами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОформленияДокументовТовародвижений"

	Дано Я открываю основную форму отчета "КонтрольОформленияДокументовТовародвижений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОформленияДокументовТовародвижений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"

	Дано Я открываю основную форму отчета "КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольПередачТоваровМеждуОрганизациями"

	Дано Я открываю основную форму отчета "КонтрольПередачТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольПередачТоваровМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КредиторскаяЗадолженность"

	Дано Я открываю основную форму отчета "КредиторскаяЗадолженность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КредиторскаяЗадолженность"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму отчета "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МатериалыВЭксплуатации"

	Дано Я открываю основную форму отчета "МатериалыВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МатериалыВЭксплуатации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МониторЦелевыхПоказателей"

	Дано Я открываю основную форму отчета "МониторЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МониторЦелевыхПоказателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НаличиеСчетовФактур"

	Дано Я открываю основную форму отчета "НаличиеСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НаличиеСчетовФактур"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСписка"

	Дано Я открываю основную форму отчета "НастройкаСписка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НастройкаСписка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НеобработанныеТТНЕГАИС"

	Дано Я открываю основную форму отчета "НеобработанныеТТНЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НеобработанныеТТНЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборачиваемостьЗапасов"

	Дано Я открываю основную форму отчета "ОборачиваемостьЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборачиваемостьЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомостьАктивовПассивов"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомостьАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомостьАктивовПассивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбработанныеЧекиЕГАИС"

	Дано Я открываю основную форму отчета "ОбработанныеЧекиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбработанныеЧекиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОплатаЗаявокНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму отчета "ОплатаЗаявокНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОплатаЗаявокНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиИДвиженияДенежныхСредствВКассахККМ"

	Дано Я открываю основную форму отчета "ОстаткиИДвиженияДенежныхСредствВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиИДвиженияДенежныхСредствВКассахККМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиИДоступностьТоваров"

	Дано Я открываю основную форму отчета "ОстаткиИДоступностьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиИДоступностьТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровОрганизаций"

	Дано Я открываю основную форму отчета "ОстаткиТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПереданныхНаКомиссию"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПереданныхНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПереданныхНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровПринятыхНаКомиссию"

	Дано Я открываю основную форму отчета "ОстаткиТоваровПринятыхНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровПринятыхНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклоненияОтУсловийЗакупок"

	Дано Я открываю основную форму отчета "ОтклоненияОтУсловийЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклоненияОтУсловийЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтклоненияОтУсловийПродаж"

	Дано Я открываю основную форму отчета "ОтклоненияОтУсловийПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтклоненияОтУсловийПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтрицательныеОстаткиТоваровИРезервовОрганизаций"

	Дано Я открываю основную форму отчета "ОтрицательныеОстаткиТоваровИРезервовОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтрицательныеОстаткиТоваровИРезервовОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтрицательныеОстаткиТоваровОрганизаций"

	Дано Я открываю основную форму отчета "ОтрицательныеОстаткиТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтрицательныеОстаткиТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОформлениеИзлишковНедостачТоваров"

	Дано Я открываю основную форму отчета "ОформлениеИзлишковНедостачТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОформлениеИзлишковНедостачТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОформлениеОтчетовКомитенту"

	Дано Я открываю основную форму отчета "ОформлениеОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОформлениеОтчетовКомитенту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаРентабельностиПродаж"

	Дано Я открываю основную форму отчета "ОценкаРентабельностиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаРентабельностиПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПартнерыКоторымОтгрузкаЗапрещена"

	Дано Я открываю основную форму отчета "ПартнерыКоторымОтгрузкаЗапрещена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПартнерыКоторымОтгрузкаЗапрещена"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереданнаяВозвратнаяТара"

	Дано Я открываю основную форму отчета "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересеченияСегментаНоменклатуры"

	Дано Я открываю основную форму отчета "ПересеченияСегментаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересеченияСегментаНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПересеченияСегментаПартнеров"

	Дано Я открываю основную форму отчета "ПересеченияСегментаПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПересеченияСегментаПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"

	Дано Я открываю основную форму отчета "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"

	Дано Я открываю основную форму отчета "ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализРаботыТорговыхПредставителейПоСумме"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализФинансовыхИнструментов"

	Дано Я открываю основную форму отчета "ПланФактныйАнализФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализФинансовыхИнструментов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежнаяДисциплинаКлиентов"

	Дано Я открываю основную форму отчета "ПлатежнаяДисциплинаКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлатежнаяДисциплинаКлиентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежнаяДисциплинаКлиентов24"

	Дано Я открываю основную форму отчета "ПлатежнаяДисциплинаКлиентов24"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлатежнаяДисциплинаКлиентов24"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоступлениеИОтгрузкаТоваров"

	Дано Я открываю основную форму отчета "ПоступлениеИОтгрузкаТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПоступлениеИОтгрузкаТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоступленияБезДокументовГИСМ"

	Дано Я открываю основную форму отчета "ПоступленияБезДокументовГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПоступленияБезДокументовГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПраваДоступа"

	Дано Я открываю основную форму отчета "ПраваДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПраваДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛист"

	Дано Я открываю основную форму отчета "ПрайсЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрайсЛист"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛистДляПриемаЗаказов"

	Дано Я открываю основную форму отчета "ПрайсЛистДляПриемаЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрайсЛистДляПриемаЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрименениеСерииНоменклатуры"

	Дано Я открываю основную форму отчета "ПрименениеСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрименениеСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПримененныеСкидкиВДокументе"

	Дано Я открываю основную форму отчета "ПримененныеСкидкиВДокументе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПримененныеСкидкиВДокументе"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПринятаяВозвратнаяТара"

	Дано Я открываю основную форму отчета "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПричиныЗапретаОтгрузки"

	Дано Я открываю основную форму отчета "ПричиныЗапретаОтгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПричиныЗапретаОтгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроблемыПроверкиКонтрагентов"

	Дано Я открываю основную форму отчета "ПроблемыПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроблемыПроверкиКонтрагентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиМеждуОрганизациями"

	Дано Я открываю основную форму отчета "ПродажиМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиСравнениеАналогичныхПериодов"

	Дано Я открываю основную форму отчета "ПродажиСравнениеАналогичныхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиСравнениеАналогичныхПериодов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиСравнениеДвухПериодов"

	Дано Я открываю основную форму отчета "ПродажиСравнениеДвухПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиСравнениеДвухПериодов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроизводительностьРаботниковСклада"

	Дано Я открываю основную форму отчета "ПроизводительностьРаботниковСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроизводительностьРаботниковСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПубликуемыеТорговыеПредложения"

	Дано Я открываю основную форму отчета "ПубликуемыеТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПубликуемыеТорговыеПредложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"

	Дано Я открываю основную форму отчета "РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РазвернутоеСальдоПоВидамЗапасовИНомерамГТД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаспределениеТорговыхПредставителей"

	Дано Я открываю основную форму отчета "РаспределениеТорговыхПредставителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РаспределениеТорговыхПредставителей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыМеждуОрганизациями"

	Дано Я открываю основную форму отчета "РасчетыМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыМеждуОрганизациями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСКлиентами"

	Дано Я открываю основную форму отчета "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПартнерами"

	Дано Я открываю основную форму отчета "РасчетыСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПоставщиками"

	Дано Я открываю основную форму отчета "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаПоступленийПоНоменклатуре"

	Дано Я открываю основную форму отчета "РасшифровкаПоступленийПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаПоступленийПоНоменклатуре"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрКредитовИДепозитов"

	Дано Я открываю основную форму отчета "РеестрКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрКредитовИДепозитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрНормативноСправочнойИнформации"

	Дано Я открываю основную форму отчета "РеестрНормативноСправочнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрНормативноСправочнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрПлатежей"

	Дано Я открываю основную форму отчета "РеестрПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрПлатежей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрСчетовФактурДляСверки"

	Дано Я открываю основную форму отчета "РеестрСчетовФактурДляСверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрСчетовФактурДляСверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрТорговыхДокументов"

	Дано Я открываю основную форму отчета "РеестрТорговыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрТорговыхДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрУчетныхДанных"

	Дано Я открываю основную форму отчета "РеестрУчетныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрУчетныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЗакупки"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияПродажи"

	Дано Я открываю основную форму отчета "РезультатыСогласованияПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСогласованияЦенНоменклатуры"

	Дано Я открываю основную форму отчета "РезультатыСогласованияЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСогласованияЦенНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыТестирования"

	Дано Я открываю основную форму отчета "РезультатыТестирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыТестирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СбалансированностьПлановУТ"

	Дано Я открываю основную форму отчета "СбалансированностьПлановУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СбалансированностьПлановУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаДанныхПартионногоУчетаИСебестоимости"

	Дано Я открываю основную форму отчета "СверкаДанныхПартионногоУчетаИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаДанныхПартионногоУчетаИСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаОстатковОперативногоУчетаИСебестоимости"

	Дано Я открываю основную форму отчета "СверкаОстатковОперативногоУчетаИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаОстатковОперативногоУчетаИСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверкаРасчетовСПартнерами"

	Дано Я открываю основную форму отчета "СверкаРасчетовСПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СверкаРасчетовСПартнерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныйОтчетЕГАИС"

	Дано Я открываю основную форму отчета "СводныйОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныйОтчетЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СертификатыНоменклатурыСИстекающимСрокомДействия"

	Дано Я открываю основную форму отчета "СертификатыНоменклатурыСИстекающимСрокомДействия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СертификатыНоменклатурыСИстекающимСрокомДействия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СобытияМониторингаСПАРКРиски"

	Дано Я открываю основную форму отчета "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставПродажи"

	Дано Я открываю основную форму отчета "СоставПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставСегмента"

	Дано Я открываю основную форму отчета "СоставСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставСегмента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеАссортимента"

	Дано Я открываю основную форму отчета "СостояниеАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеВыполненияДокументов"

	Дано Я открываю основную форму отчета "СостояниеВыполненияДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеВыполненияДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКлиентами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКлиентамиСамообслуживание"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКлиентамиСамообслуживание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКлиентамиСамообслуживание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКомиссионерами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКомиссионерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКомиссионерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСКомитентами"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСКомитентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСКомитентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеРасчетовСПоставщиками"

	Дано Я открываю основную форму отчета "СостояниеРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеРасчетовСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетПереоценкиВалютныхСредств"

	Дано Я открываю основную форму отчета "СправкаРасчетПереоценкиВалютныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетПереоценкиВалютныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправочноеРазмещениеНоменклатуры"

	Дано Я открываю основную форму отчета "СправочноеРазмещениеНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправочноеРазмещениеНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеГрафиковКредитовИДепозитов"

	Дано Я открываю основную форму отчета "СравнениеГрафиковКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеГрафиковКредитовИДепозитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеСегментовПартнеров"

	Дано Я открываю основную форму отчета "СравнениеСегментовПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеСегментовПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнительныйАнализДинамикиАссортиментаИПродаж"

	Дано Я открываю основную форму отчета "СравнительныйАнализДинамикиАссортиментаИПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнительныйАнализДинамикиАссортиментаИПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнительныйАнализПоказателейРаботыМенеджеров"

	Дано Я открываю основную форму отчета "СравнительныйАнализПоказателейРаботыМенеджеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнительныйАнализПоказателейРаботыМенеджеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтруктураСерииНоменклатуры"

	Дано Я открываю основную форму отчета "СтруктураСерииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтруктураСерииНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущаяНаполненностьАссортимента"

	Дано Я открываю основную форму отчета "ТекущаяНаполненностьАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТекущаяНаполненностьАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеКвотыАссортимента"

	Дано Я открываю основную форму отчета "ТекущиеКвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТекущиеКвотыАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварныйКалендарь"

	Дано Я открываю основную форму отчета "ТоварныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварныйОтчетТОРГ29"

	Дано Я открываю основную форму отчета "ТоварныйОтчетТОРГ29"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварныйОтчетТОРГ29"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыВЯчейках"

	Дано Я открываю основную форму отчета "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыВЯчейках"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКОтбору"

	Дано Я открываю основную форму отчета "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКОтгрузке"

	Дано Я открываю основную форму отчета "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКОтгрузке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыКПоступлению"

	Дано Я открываю основную форму отчета "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыКПоступлению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыНаСкладахПоСрокамГодности"

	Дано Я открываю основную форму отчета "ТоварыНаСкладахПоСрокамГодности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыНаСкладахПоСрокамГодности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПереданныеНаКомиссию"

	Дано Я открываю основную форму отчета "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыПринятыеНаКомиссию"

	Дано Я открываю основную форму отчета "ТоварыПринятыеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыПринятыеНаКомиссию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыСИстекающимиСертификатами"

	Дано Я открываю основную форму отчета "ТоварыСИстекающимиСертификатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыСИстекающимиСертификатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварыСхемыОбеспечения"

	Дано Я открываю основную форму отчета "ТоварыСхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварыСхемыОбеспечения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьВедомостьПоДенежнымСредствам"

	Дано Я открываю основную форму отчета "УдалитьВедомостьПоДенежнымСредствам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьВедомостьПоДенежнымСредствам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьГрафикОплатНачисленийКредитовИДепозитов"

	Дано Я открываю основную форму отчета "УдалитьГрафикОплатНачисленийКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьГрафикОплатНачисленийКредитовИДепозитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправленческийБаланс"

	Дано Я открываю основную форму отчета "УправленческийБаланс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УправленческийБаланс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправленческийБалансКонтроль"

	Дано Я открываю основную форму отчета "УправленческийБалансКонтроль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УправленческийБалансКонтроль"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияЗакупок"

	Дано Я открываю основную форму отчета "УсловияЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УсловияЗакупок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияПродаж"

	Дано Я открываю основную форму отчета "УсловияПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УсловияПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФинансовоеСостояние"

	Дано Я открываю основную форму отчета "ФинансовоеСостояние"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФинансовоеСостояние"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЭффективностьСделокСКлиентами"

	Дано Я открываю основную форму отчета "ЭффективностьСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЭффективностьСделокСКлиентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АрхивированиеУдалениеЧековККМ"

	Дано Я открываю основную форму обработки "АрхивированиеУдалениеЧековККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АрхивированиеУдалениеЧековККМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесСеть"

	Дано Я открываю основную форму обработки "БизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БизнесСеть"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВиртуальнаяАгрегацияУпаковокИСМП"

	Дано Я открываю основную форму обработки "ВиртуальнаяАгрегацияУпаковокИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВиртуальнаяАгрегацияУпаковокИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВходящиеСообщенияУТМЕГАИС"

	Дано Я открываю основную форму обработки "ВходящиеСообщенияУТМЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВходящиеСообщенияУТМЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаБазыТоваровВТСД"

	Дано Я открываю основную форму обработки "ВыгрузкаБазыТоваровВТСД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаБазыТоваровВТСД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхГрафЗависимостейСловарейСопоставленияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГенерацияТопологииСклада"

	Дано Я открываю основную форму обработки "ГенерацияТопологииСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГенерацияТопологииСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГенерацияШтрихкодовУпаковок"

	Дано Я открываю основную форму обработки "ГенерацияШтрихкодовУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГенерацияШтрихкодовУпаковок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияАктивовПассивов"

	Дано Я открываю основную форму обработки "ДвиженияАктивовПассивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДвиженияАктивовПассивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДокументыПоПартнеруИСделке"

	Дано Я открываю основную форму обработки "ДокументыПоПартнеруИСделке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДокументыПоПартнеруИСделке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовАвансовыеОтчеты"

	Дано Я открываю основную форму обработки "ЖурналДокументовАвансовыеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовАвансовыеОтчеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовБезналичныеПлатежи"

	Дано Я открываю основную форму обработки "ЖурналДокументовБезналичныеПлатежи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовБезналичныеПлатежи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовВнутреннегоТовародвижения"

	Дано Я открываю основную форму обработки "ЖурналДокументовВнутреннегоТовародвижения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовВнутреннегоТовародвижения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовЗакупки"

	Дано Я открываю основную форму обработки "ЖурналДокументовЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовИнтеркампани"

	Дано Я открываю основную форму обработки "ЖурналДокументовИнтеркампани"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовИнтеркампани"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовНДС"

	Дано Я открываю основную форму обработки "ЖурналДокументовНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПлатежи"

	Дано Я открываю основную форму обработки "ЖурналДокументовПлатежи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПлатежи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналДокументовПродажи"

	Дано Я открываю основную форму обработки "ЖурналДокументовПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналДокументовПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналСкладскихАктов"

	Дано Я открываю основную форму обработки "ЖурналСкладскихАктов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналСкладскихАктов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаДанныхИзВнешнихФайлов"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзВнешнихФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзВнешнихФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаОтчетаБанкаПоЭквайрингу"

	Дано Я открываю основную форму обработки "ЗагрузкаОтчетаБанкаПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаОтчетаБанкаПоЭквайрингу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаЦенПоставщикаИзВнешнихФайлов"

	Дано Я открываю основную форму обработки "ЗагрузкаЦенПоставщикаИзВнешнихФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаЦенПоставщикаИзВнешнихФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеАктаОНесоответствииВЕТИС"

	Дано Я открываю основную форму обработки "ЗаполнениеАктаОНесоответствииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеАктаОНесоответствииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКорректировкиНазначения"

	Дано Я открываю основную форму обработки "ЗаполнениеКорректировкиНазначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКорректировкиНазначения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеРегистровВзаиморасчетов"

	Дано Я открываю основную форму обработки "ЗаполнениеРегистровВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеРегистровВзаиморасчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапросыКоммерческихПредложений"

	Дано Я открываю основную форму обработки "ЗапросыКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗапросыКоммерческихПредложений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнструкцияПоИспользованиюПроверкиКонтрагента"

	Дано Я открываю основную форму обработки "ИнструкцияПоИспользованиюПроверкиКонтрагента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнструкцияПоИспользованиюПроверкиКонтрагента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияС1СДокументооборот"

	Дано Я открываю основную форму обработки "ИнтеграцияС1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияС1СДокументооборот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"

	Дано Я открываю основную форму обработки "ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтеграцияС1СОблачнаяКартаПрикладныхРешений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформационныйЦентр"

	Дано Я открываю основную форму обработки "ИнформационныйЦентр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформационныйЦентр"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсправлениеРеестраДокументов"

	Дано Я открываю основную форму обработки "ИсправлениеРеестраДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсправлениеРеестраДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсточникиДанныхПланирования"

	Дано Я открываю основную форму обработки "ИсточникиДанныхПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИсточникиДанныхПланирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КаталогРасширений"

	Дано Я открываю основную форму обработки "КаталогРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КаталогРасширений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КлассификаторыВЕТИС"

	Дано Я открываю основную форму обработки "КлассификаторыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КлассификаторыВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Классификация"

	Дано Я открываю основную форму обработки "Классификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Классификация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КлиентБанк"

	Дано Я открываю основную форму обработки "КлиентБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КлиентБанк"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МенеджерМобильныхПриложений"

	Дано Я открываю основную форму обработки "МенеджерМобильныхПриложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МенеджерМобильныхПриложений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МиграцияПриложения"

	Дано Я открываю основную форму обработки "МиграцияПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МиграцияПриложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МониторПортала1СИТС"

	Дано Я открываю основную форму обработки "МониторПортала1СИТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки МониторПортала1СИТС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПоддержанияЗапасов"

	Дано Я открываю основную форму обработки "НастройкаПоддержанияЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПоддержанияЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаПостановкиКонтрагентовНаМониторингСПАРК"

	Дано Я открываю основную форму обработки "НастройкаПостановкиКонтрагентовНаМониторингСПАРК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаПостановкиКонтрагентовНаМониторингСПАРК"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРезервногоКопированияПриложения"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияПриложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСпособовОбеспеченияПотребностей"

	Дано Я открываю основную форму обработки "НастройкаСпособовОбеспеченияПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСпособовОбеспеченияПотребностей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаХозяйственныхОпераций"

	Дано Я открываю основную форму обработки "НастройкаХозяйственныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаХозяйственныхОпераций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбеспечениеПотребностей"

	Дано Я открываю основную форму обработки "ОбеспечениеПотребностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбеспечениеПотребностей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОблачныйАрхив"

	Дано Я открываю основную форму обработки "ОблачныйАрхив"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОблачныйАрхив"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменДаннымиСМобильнымиПриложениями"

	Дано Я открываю основную форму обработки "ОбменДаннымиСМобильнымиПриложениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменДаннымиСМобильнымиПриложениями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСБанками"

	Дано Я открываю основную форму обработки "ОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСБанками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСКонтрагентами"

	Дано Я открываю основную форму обработки "ОбменСКонтрагентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСКонтрагентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменСОфлайнОборудованием"

	Дано Я открываю основную форму обработки "ОбменСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменСОфлайнОборудованием"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбменССайтами"

	Дано Я открываю основную форму обработки "ОбменССайтами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбменССайтами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеКлассификаторов"

	Дано Я открываю основную форму обработки "ОбновлениеКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеКлассификаторов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеПрограммы"

	Дано Я открываю основную форму обработки "ОбновлениеПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОперацииЗакрытияМесяца"

	Дано Я открываю основную форму обработки "ОперацииЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОперацииЗакрытияМесяца"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОплатаСервиса"

	Дано Я открываю основную форму обработки "ОплатаСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОплатаСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОчисткаДвиженийПриОтключенномУчетеСебестоимости"

	Дано Я открываю основную форму обработки "ОчисткаДвиженийПриОтключенномУчетеСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОчисткаДвиженийПриОтключенномУчетеСебестоимости"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Панель1СМаркировка"

	Дано Я открываю основную форму обработки "Панель1СМаркировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Панель1СМаркировка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрирования1СМаркировка"

	Дано Я открываю основную форму обработки "ПанельАдминистрирования1СМаркировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрирования1СМаркировка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБИД"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБИД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБИД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСПВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСПВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСПВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияВЕТИС"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияИСМП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияОбменаССайтом"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияОбменаССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияОбменаССайтом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияУТ"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияУТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияУТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияЭДО"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменВЕТИС"

	Дано Я открываю основную форму обработки "ПанельОбменВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменИСМП"

	Дано Я открываю основную форму обработки "ПанельОбменИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельОбменСЕГАИС"

	Дано Я открываю основную форму обработки "ПанельОбменСЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельОбменСЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковБюджетирования"

	Дано Я открываю основную форму обработки "ПанельСправочниковБюджетирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковБюджетирования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковМаркетинг"

	Дано Я открываю основную форму обработки "ПанельСправочниковМаркетинг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковМаркетинг"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковНСИ"

	Дано Я открываю основную форму обработки "ПанельСправочниковНСИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковНСИ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельСправочниковСклад"

	Дано Я открываю основную форму обработки "ПанельСправочниковСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельСправочниковСклад"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПервоначальноеЗаполнениеРегистровПартионногоУчета"

	Дано Я открываю основную форму обработки "ПервоначальноеЗаполнениеРегистровПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПервоначальноеЗаполнениеРегистровПартионногоУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереносФайловВТома"

	Дано Я открываю основную форму обработки "ПереносФайловВТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайловВТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереходНаСинхронизациюДанныхЧерезУниверсальныйФормат"

	Дано Я открываю основную форму обработки "ПереходНаСинхронизациюДанныхЧерезУниверсальныйФормат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереходНаСинхронизациюДанныхЧерезУниверсальныйФормат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПеречислениеНДСВБюджетПоОтдельнымОперациям"

	Дано Я открываю основную форму обработки "ПеречислениеНДСВБюджетПоОтдельнымОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПеречислениеНДСВБюджетПоОтдельнымОперациям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьАктОбОказанииУслуг"

	Дано Я открываю основную форму обработки "ПечатьАктОбОказанииУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьАктОбОказанииУслуг"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьАктыОРасхождениях"

	Дано Я открываю основную форму обработки "ПечатьАктыОРасхождениях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьАктыОРасхождениях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаданияНаОтборРазмещениеТоваров"

	Дано Я открываю основную форму обработки "ПечатьЗаданияНаОтборРазмещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаданияНаОтборРазмещениеТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаказовНаТоварыУслуги"

	Дано Я открываю основную форму обработки "ПечатьЗаказовНаТоварыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаказовНаТоварыУслуги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЗаявленияНаВозвратТоваровОтКлиента"

	Дано Я открываю основную форму обработки "ПечатьЗаявленияНаВозвратТоваровОтКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЗаявленияНаВозвратТоваровОтКлиента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИзвещений"

	Дано Я открываю основную форму обработки "ПечатьИзвещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИзвещений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИНВ19"

	Дано Я открываю основную форму обработки "ПечатьИНВ19"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИНВ19"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьИНВ3"

	Дано Я открываю основную форму обработки "ПечатьИНВ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьИНВ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьКМ3"

	Дано Я открываю основную форму обработки "ПечатьКМ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьКМ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьМ11"

	Дано Я открываю основную форму обработки "ПечатьМ11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьМ11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОбщихФорм"

	Дано Я открываю основную форму обработки "ПечатьОбщихФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОбщихФорм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьОтчетовПоКомиссии"

	Дано Я открываю основную форму обработки "ПечатьОтчетовПоКомиссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьОтчетовПоКомиссии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьПодарочныхСертификатов"

	Дано Я открываю основную форму обработки "ПечатьПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьПодарочныхСертификатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьРазделаБСправкиТТН"

	Дано Я открываю основную форму обработки "ПечатьРазделаБСправкиТТН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьРазделаБСправкиТТН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьСчетовНаОплату"

	Дано Я открываю основную форму обработки "ПечатьСчетовНаОплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьСчетовНаОплату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТоварногоЧека"

	Дано Я открываю основную форму обработки "ПечатьТоварногоЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТоварногоЧека"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТОРГ16"

	Дано Я открываю основную форму обработки "ПечатьТОРГ16"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТОРГ16"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТранспортнойНакладной"

	Дано Я открываю основную форму обработки "ПечатьТранспортнойНакладной"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТранспортнойНакладной"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьТТН"

	Дано Я открываю основную форму обработки "ПечатьТТН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьТТН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокВЕТИС"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПечатьЭтикетокИЦенников"

	Дано Я открываю основную форму обработки "ПечатьЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПечатьЭтикетокИЦенников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежныйКалендарь"

	Дано Я открываю основную форму обработки "ПлатежныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПлатежныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборМногооборотнойТары"

	Дано Я открываю основную форму обработки "ПодборМногооборотнойТары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборМногооборотнойТары"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборПартнеровПоОтбору"

	Дано Я открываю основную форму обработки "ПодборПартнеровПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборПартнеровПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборПоТоварнымКатегориям"

	Дано Я открываю основную форму обработки "ПодборПоТоварнымКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборПоТоварнымКатегориям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборСерийВДокументы"

	Дано Я открываю основную форму обработки "ПодборСерийВДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборСерийВДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоварныхКатегорийПоОтбору"

	Дано Я открываю основную форму обработки "ПодборТоварныхКатегорийПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоварныхКатегорийПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровВДокументЗакупки"

	Дано Я открываю основную форму обработки "ПодборТоваровВДокументЗакупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровВДокументЗакупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровВДокументПродажи"

	Дано Я открываю основную форму обработки "ПодборТоваровВДокументПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровВДокументПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодборТоваровПоОтбору"

	Дано Я открываю основную форму обработки "ПодборТоваровПоОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодборТоваровПоОтбору"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодготовкаСведенийВКаталогGS46"

	Дано Я открываю основную форму обработки "ПодготовкаСведенийВКаталогGS46"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодготовкаСведенийВКаталогGS46"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Подключение1СТакском"

	Дано Я открываю основную форму обработки "Подключение1СТакском"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Подключение1СТакском"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеСервисовСопровождения"

	Дано Я открываю основную форму обработки "ПодключениеСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеСервисовСопровождения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодтверждениеПоступившихКиЗГИСМ"

	Дано Я открываю основную форму обработки "ПодтверждениеПоступившихКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодтверждениеПоступившихКиЗГИСМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискОбъектовПоШтрихкоду"

	Дано Я открываю основную форму обработки "ПоискОбъектовПоШтрихкоду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискОбъектовПоШтрихкоду"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗакрытияЗаказов"

	Дано Я открываю основную форму обработки "ПомощникЗакрытияЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗакрытияЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗаменыСтавкиНДС"

	Дано Я открываю основную форму обработки "ПомощникЗаменыСтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗаменыСтавкиНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникЗачетаОплат"

	Дано Я открываю основную форму обработки "ПомощникЗачетаОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникЗачетаОплат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИсправленияОстатковТоваровОрганизаций"

	Дано Я открываю основную форму обработки "ПомощникИсправленияОстатковТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИсправленияОстатковТоваровОрганизаций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникКорректировкиОстатковЕГАИС"

	Дано Я открываю основную форму обработки "ПомощникКорректировкиОстатковЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникКорректировкиОстатковЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиПараметровБазовойВерсии"

	Дано Я открываю основную форму обработки "ПомощникНастройкиПараметровБазовойВерсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиПараметровБазовойВерсии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиПодключенияВнешнейСистемы"

	Дано Я открываю основную форму обработки "ПомощникНастройкиПодключенияВнешнейСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиПодключенияВнешнейСистемы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"

	Дано Я открываю основную форму обработки "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникОбращенияВТехническуюПоддержку"

	Дано Я открываю основную форму обработки "ПомощникОбращенияВТехническуюПоддержку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникОбращенияВТехническуюПоддержку"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникОформленияСкладскихАктов"

	Дано Я открываю основную форму обработки "ПомощникОформленияСкладскихАктов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникОформленияСкладскихАктов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСДругихКонфигураций"

	Дано Я открываю основную форму обработки "ПомощникПереходаСДругихКонфигураций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСДругихКонфигураций"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСТорговляИСклад77"

	Дано Я открываю основную форму обработки "ПомощникПереходаСТорговляИСклад77"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСТорговляИСклад77"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПереходаСУправлениеТорговлей103"

	Дано Я открываю основную форму обработки "ПомощникПереходаСУправлениеТорговлей103"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПереходаСУправлениеТорговлей103"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПоУчетуНДС"

	Дано Я открываю основную форму обработки "ПомощникПоУчетуНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПоУчетуНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникПродаж"

	Дано Я открываю основную форму обработки "ПомощникПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияАвтономногоРабочегоМеста"

	Дано Я открываю основную форму обработки "ПомощникСозданияАвтономногоРабочегоМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияАвтономногоРабочегоМеста"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"

	Дано Я открываю основную форму обработки "ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникФормированияСкладскихДокументовПоВыводуИзАссортимента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛист"

	Дано Я открываю основную форму обработки "ПрайсЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрайсЛист"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрайсЛистПоставщика"

	Дано Я открываю основную форму обработки "ПрайсЛистПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрайсЛистПоставщика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПредпросмотрЧека"

	Дано Я открываю основную форму обработки "ПредпросмотрЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПредпросмотрЧека"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИзмеренийВРегистрахБухгалтерии"

	Дано Я открываю основную форму обработки "ПроверкаИзмеренийВРегистрахБухгалтерии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИзмеренийВРегистрахБухгалтерии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИКорректировкаДанных"

	Дано Я открываю основную форму обработки "ПроверкаИКорректировкаДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИКорректировкаДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму обработки "ПроверкаИПодборАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборПродукцииИСМП"

	Дано Я открываю основную форму обработки "ПроверкаИПодборПродукцииИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборПродукцииИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаИПодборТабачнойПродукцииМОТП"

	Дано Я открываю основную форму обработки "ПроверкаИПодборТабачнойПродукцииМОТП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаИПодборТабачнойПродукцииМОТП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаКоличестваТоваровВДокументе"

	Дано Я открываю основную форму обработки "ПроверкаКоличестваТоваровВДокументе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаКоличестваТоваровВДокументе"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаКоличестваТоваровВПриходномОрдере"

	Дано Я открываю основную форму обработки "ПроверкаКоличестваТоваровВПриходномОрдере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПроверкаКоличестваТоваровВПриходномОрдере"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСАктамиРасхождений"

	Дано Я открываю основную форму обработки "РаботаСАктамиРасхождений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСАктамиРасхождений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСАкцизнымиМаркамиЕГАИС"

	Дано Я открываю основную форму обработки "РаботаСАкцизнымиМаркамиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСАкцизнымиМаркамиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСКМПриПеремаркировкеТоваровИСМП"

	Дано Я открываю основную форму обработки "РаботаСКМПриПеремаркировкеТоваровИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСКМПриПеремаркировкеТоваровИСМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСНоменклатурой"

	Дано Я открываю основную форму обработки "РаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСНоменклатурой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСОблачнымиКлассификаторами"

	Дано Я открываю основную форму обработки "РаботаСОблачнымиКлассификаторами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСОблачнымиКлассификаторами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РабочееМестоМенеджераПоДоставке"

	Дано Я открываю основную форму обработки "РабочееМестоМенеджераПоДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РабочееМестоМенеджераПоДоставке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РабочееМестоРаботникаСклада"

	Дано Я открываю основную форму обработки "РабочееМестоРаботникаСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РабочееМестоРаботникаСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РедактированиеНабора"

	Дано Я открываю основную форму обработки "РедактированиеНабора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РедактированиеНабора"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СамообслуживаниеПартнеров"

	Дано Я открываю основную форму обработки "СамообслуживаниеПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СамообслуживаниеПартнеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СверткаИнформационнойБазы"

	Дано Я открываю основную форму обработки "СверткаИнформационнойБазы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СверткаИнформационнойБазы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеКлассификаторовЕГАИС"

	Дано Я открываю основную форму обработки "СопоставлениеКлассификаторовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеКлассификаторовЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеНоменклатурыБЭД"

	Дано Я открываю основную форму обработки "СопоставлениеНоменклатурыБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеНоменклатурыБЭД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеНоменклатурыЕГАИС"

	Дано Я открываю основную форму обработки "СопоставлениеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеНоменклатурыЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеОбеспечения"

	Дано Я открываю основную форму обработки "СостояниеОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СостояниеОбеспечения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаСПАРКРиски"

	Дано Я открываю основную форму обработки "СправкаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СправкаСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправочноеРазмещениеНоменклатуры"

	Дано Я открываю основную форму обработки "СправочноеРазмещениеНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СправочноеРазмещениеНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТестированиеОперацийЗакрытийМесяца"

	Дано Я открываю основную форму обработки "ТестированиеОперацийЗакрытийМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТестированиеОперацийЗакрытийМесяца"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТорговыеПредложения"

	Дано Я открываю основную форму обработки "ТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТорговыеПредложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаВнешняяСистема"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаВнешняяСистема"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаВнешняяСистема"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеНеиспользуемыхЭлементовСправочников"

	Дано Я открываю основную форму обработки "УдалениеНеиспользуемыхЭлементовСправочников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеНеиспользуемыхЭлементовСправочников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеНовостями"

	Дано Я открываю основную форму обработки "УправлениеНовостями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеНовостями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеОтгрузкой"

	Дано Я открываю основную форму обработки "УправлениеОтгрузкой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеОтгрузкой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПереданнойВозвратнойТарой"

	Дано Я открываю основную форму обработки "УправлениеПереданнойВозвратнойТарой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПереданнойВозвратнойТарой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПеремещениемОбособленныхТоваров"

	Дано Я открываю основную форму обработки "УправлениеПеремещениемОбособленныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПеремещениемОбособленныхТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПоступлением"

	Дано Я открываю основную форму обработки "УправлениеПоступлением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПоступлением"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеПринятойВозвратнойТарой"

	Дано Я открываю основную форму обработки "УправлениеПринятойВозвратнойТарой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеПринятойВозвратнойТарой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УсловияРегионализацииВЕТИС"

	Дано Я открываю основную форму обработки "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовНаСборкуРазборкуПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовНаСборкуРазборкуПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовНаСборкуРазборкуПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовПоставщикам"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеЗаказовПоставщикуПоПлану"

	Дано Я открываю основную форму обработки "ФормированиеЗаказовПоставщикуПоПлану"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеЗаказовПоставщикуПоПлану"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"

	Дано Я открываю основную форму обработки "ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ФормированиеПередачТоваровМеждуОрганизациямиИВыкупов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ABCXYZКлассификацияКлиентов" 

	Дано Я открываю основную форму списка регистра сведений "ABCXYZКлассификацияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ABCXYZКлассификацияКлиентов"

	Дано Я открываю основную форму регистра сведений "ABCXYZКлассификацияКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ABCXYZКлассификацияНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ABCXYZКлассификацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ABCXYZКлассификацияНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ABCXYZКлассификацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ABCXYZКлассификацияНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АбонентыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "АбонентыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АбонентыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АбонентыЭДО"

	Дано Я открываю основную форму регистра сведений "АбонентыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АбонентыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АдресаЗонОтветственностиВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "АдресаЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресаЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресаЗонОтветственностиВЕТИС"

	Дано Я открываю основную форму регистра сведений "АдресаЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресаЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресныеОбъекты"

	Дано Я открываю основную форму регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктивированныеАгентыРезервногоКопирования" 

	Дано Я открываю основную форму списка регистра сведений "АктивированныеАгентыРезервногоКопирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктивированныеАгентыРезервногоКопирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктивированныеАгентыРезервногоКопирования"

	Дано Я открываю основную форму регистра сведений "АктивированныеАгентыРезервногоКопирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктивированныеАгентыРезервногоКопирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АкцизныеМаркиЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "АкцизныеМаркиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АкцизныеМаркиЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АкцизныеМаркиЕГАИС"

	Дано Я открываю основную форму регистра сведений "АкцизныеМаркиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АкцизныеМаркиЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаНаборов" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНаборов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаНаборов"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНаборов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаНоменклатуры"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаПартий" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПартий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаПартий"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаПартий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПартий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаУчетаПоПартнерам" 

	Дано Я открываю основную форму списка регистра сведений "АналитикаУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПоПартнерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаУчетаПоПартнерам"

	Дано Я открываю основную форму регистра сведений "АналитикаУчетаПоПартнерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналитикаУчетаПоПартнерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Ассортимент" 

	Дано Я открываю основную форму списка регистра сведений "Ассортимент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Ассортимент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Ассортимент"

	Дано Я открываю основную форму регистра сведений "Ассортимент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Ассортимент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСкладскихЯчеек" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСкладскихЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСкладскихЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСкладскихЯчеек"

	Дано Я открываю основную форму регистра сведений "БлокировкиСкладскихЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСкладскихЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БуферОперацийСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БуферОперацийСтатистики"

	Дано Я открываю основную форму регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОбеспеченияРаботами" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыОбеспеченияРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияРаботами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОбеспеченияРаботами"

	Дано Я открываю основную форму регистра сведений "ВариантыОбеспеченияРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияРаботами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОбеспеченияТоварами" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыОбеспеченияТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияТоварами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОбеспеченияТоварами"

	Дано Я открываю основную форму регистра сведений "ВариантыОбеспеченияТоварами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыОбеспеченияТоварами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыПереупаковки" 

	Дано Я открываю основную форму списка регистра сведений "ВариантыПереупаковки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыПереупаковки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыПереупаковки"

	Дано Я открываю основную форму регистра сведений "ВариантыПереупаковки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВариантыПереупаковки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииКлассификаторов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииКлассификаторов"

	Дано Я открываю основную форму регистра сведений "ВерсииКлассификаторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииКлассификаторовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииКлассификаторовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПродукцииПоГруппамВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ВидыПродукцииПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПродукцииПоГруппамВЕТИС"

	Дано Я открываю основную форму регистра сведений "ВидыПродукцииПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПродукцииПоГруппамПриказаВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ВидыПродукцииПоГруппамПриказаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамПриказаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПродукцииПоГруппамПриказаВЕТИС"

	Дано Я открываю основную форму регистра сведений "ВидыПродукцииПоГруппамПриказаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВидыПродукцииПоГруппамПриказаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВременныеИдентификаторыЗапросов" 

	Дано Я открываю основную форму списка регистра сведений "ВременныеИдентификаторыЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременныеИдентификаторыЗапросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВременныеИдентификаторыЗапросов"

	Дано Я открываю основную форму регистра сведений "ВременныеИдентификаторыЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременныеИдентификаторыЗапросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияНовостей"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияСПАРКОбщее" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияСПАРКОбщее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияСПАРКОбщее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияСПАРКОбщее"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияСПАРКОбщее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияСПАРКОбщее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияСПАРКРазделенное" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияСПАРКРазделенное"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияСПАРКРазделенное"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияСПАРКРазделенное"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияСПАРКРазделенное"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияСПАРКРазделенное"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыполнениеОперацийЗакрытияМесяца" 

	Дано Я открываю основную форму списка регистра сведений "ВыполнениеОперацийЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеОперацийЗакрытияМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыполнениеОперацийЗакрытияМесяца"

	Дано Я открываю основную форму регистра сведений "ВыполнениеОперацийЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеОперацийЗакрытияМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыполнениеПроверокСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ВыполнениеПроверокСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеПроверокСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыполнениеПроверокСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ВыполнениеПроверокСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыполнениеПроверокСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикНачисленийКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикНачисленийКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленийКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикНачисленийКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикНачисленийКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикНачисленийКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОплатКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикОплатКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОплатКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикОплатКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикОплатКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикПлатежей" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикПлатежей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикПлатежей"

	Дано Я открываю основную форму регистра сведений "ГрафикПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикПлатежей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикТраншейКредитовИДепозитов" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикТраншейКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикТраншейКредитовИДепозитов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикТраншейКредитовИДепозитов"

	Дано Я открываю основную форму регистра сведений "ГрафикТраншейКредитовИДепозитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикТраншейКредитовИДепозитов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗаявокПлатежногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗаявокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗаявокПлатежногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗаявокПлатежногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ГруппыЗаявокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗаявокПлатежногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДампыПлатформы" 

	Дано Я открываю основную форму списка регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДампыПлатформы"

	Дано Я открываю основную форму регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОснованийСчетовФактур" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОснованийСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОснованийСчетовФактур"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОснованийСчетовФактур"

	Дано Я открываю основную форму регистра сведений "ДанныеОснованийСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОснованийСчетовФактур"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "ДанныеПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПоследнихОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПоследнихОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоследнихОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПоследнихОповещений"

	Дано Я открываю основную форму регистра сведений "ДанныеПоследнихОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПоследнихОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатаЗагрузкиОтчетовКассЭвотор" 

	Дано Я открываю основную форму списка регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатаЗагрузкиОтчетовКассЭвотор"

	Дано Я открываю основную форму регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗагрузкиПоследнихНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗагрузкиПоследнихНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОбновленияСтандартныхСписковНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОбновленияСтандартныхСписковНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОтработкиПоВидамОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОтработкиПоВидамОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтработкиПоВидамОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОтработкиПоВидамОповещений"

	Дано Я открываю основную форму регистра сведений "ДатыОтработкиПоВидамОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтработкиПоВидамОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПередачиТоваровНаКомиссию" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПередачиТоваровНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПередачиТоваровНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПередачиТоваровНаКомиссию"

	Дано Я открываю основную форму регистра сведений "ДатыПередачиТоваровНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПередачиТоваровНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоступленияТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоступленияТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоступленияТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоступленияТоваровОрганизаций"

	Дано Я открываю основную форму регистра сведений "ДатыПоступленияТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоступленияТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвоичныеДанныеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвоичныеДанныеФайлов"

	Дано Я открываю основную форму регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДействиеСкидокНаценок" 

	Дано Я открываю основную форму списка регистра сведений "ДействиеСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДействиеСкидокНаценок"

	Дано Я открываю основную форму регистра сведений "ДействиеСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДействиеСкидокНаценокПоНоменклатуре" 

	Дано Я открываю основную форму списка регистра сведений "ДействиеСкидокНаценокПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценокПоНоменклатуре"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДействиеСкидокНаценокПоНоменклатуре"

	Дано Я открываю основную форму регистра сведений "ДействиеСкидокНаценокПоНоменклатуре"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДействиеСкидокНаценокПоНоменклатуре"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоВыпущеннойПродукции" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоВыпущеннойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоВыпущеннойПродукции"

	Дано Я открываю основную форму регистра сведений "ДокументыПоВыпущеннойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоВыпущеннойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыСОшибкамиПроверкиКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыСОшибкамиПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСОшибкамиПроверкиКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыСОшибкамиПроверкиКонтрагентов"

	Дано Я открываю основную форму регистра сведений "ДокументыСОшибкамиПроверкиКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСОшибкамиПроверкиКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДомаЗданияСтроения"

	Дано Я открываю основную форму регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопустимыеЦелиПоГруппамВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ДопустимыеЦелиПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопустимыеЦелиПоГруппамВЕТИС"

	Дано Я открываю основную форму регистра сведений "ДопустимыеЦелиПоГруппамВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопустимыеЦелиПоГруппамПриказаВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ДопустимыеЦелиПоГруппамПриказаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамПриказаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопустимыеЦелиПоГруппамПриказаВЕТИС"

	Дано Я открываю основную форму регистра сведений "ДопустимыеЦелиПоГруппамПриказаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеЦелиПоГруппамПриказаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступностьТоваровДляВнешнихПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ДоступностьТоваровДляВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьТоваровДляВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступностьТоваровДляВнешнихПользователей"

	Дано Я открываю основную форму регистра сведений "ДоступностьТоваровДляВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступностьТоваровДляВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеВерсииАгентаКопированияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеВерсииАгентаКопированияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеЛицензии" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеЛицензии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеЛицензии"

	Дано Я открываю основную форму регистра сведений "ДоступныеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеЛицензии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеОстаткиПланируемыхПоступлений" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеОстаткиПланируемыхПоступлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеОстаткиПланируемыхПоступлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеОстаткиПланируемыхПоступлений"

	Дано Я открываю основную форму регистра сведений "ДоступныеОстаткиПланируемыхПоступлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеОстаткиПланируемыхПоступлений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналРегистрацииАгентаКопированияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналСобытийОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналСобытийОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналСобытийЭД" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналСобытийЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналСобытийЭД"

	Дано Я открываю основную форму регистра сведений "ЖурналСобытийЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналУчетаСчетовФактур" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналУчетаСчетовФактур"

	Дано Я открываю основную форму регистра сведений "ЖурналУчетаСчетовФактур"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналУчетаСчетовФактур"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналФискальныхОпераций" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналФискальныхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналФискальныхОпераций"

	Дано Я открываю основную форму регистра сведений "ЖурналФискальныхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналФискальныхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗависимостиПравДоступа"

	Дано Я открываю основную форму регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагруженныеВерсииАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКЗакрытиюМесяца" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКЗакрытиюМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКЗакрытиюМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКЗакрытиюМесяца"

	Дано Я открываю основную форму регистра сведений "ЗаданияКЗакрытиюМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКЗакрытиюМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетов" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетов"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетовСКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетовСКлиентами"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетовСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРаспределениюРасчетовСПоставщиками" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРаспределениюРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРаспределениюРасчетовСПоставщиками"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРаспределениюРасчетовСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРаспределениюРасчетовСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКРасчетуСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКРасчетуСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКРасчетуСебестоимости"

	Дано Я открываю основную форму регистра сведений "ЗаданияКРасчетуСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКРасчетуСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданияКФормированиюЗаписейКнигиПокупокПродаж" 

	Дано Я открываю основную форму списка регистра сведений "ЗаданияКФормированиюЗаписейКнигиПокупокПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюЗаписейКнигиПокупокПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданияКФормированиюЗаписейКнигиПокупокПродаж"

	Дано Я открываю основную форму регистра сведений "ЗаданияКФормированиюЗаписейКнигиПокупокПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаданияКФормированиюЗаписейКнигиПокупокПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыПоставщикамПоЗапросам" 

	Дано Я открываю основную форму списка регистра сведений "ЗаказыПоставщикамПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаказыПоставщикамПоЗапросам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыПоставщикамПоЗапросам"

	Дано Я открываю основную форму регистра сведений "ЗаказыПоставщикамПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаказыПоставщикамПоЗапросам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыКомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыКомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамещениеПланов" 

	Дано Я открываю основную форму списка регистра сведений "ЗамещениеПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамещениеПланов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамещениеПланов"

	Дано Я открываю основную форму регистра сведений "ЗамещениеПланов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамещениеПланов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятыеЛицензии" 

	Дано Я открываю основную форму списка регистра сведений "ЗанятыеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятыеЛицензии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятыеЛицензии"

	Дано Я открываю основную форму регистра сведений "ЗанятыеЛицензии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗанятыеЛицензии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаВРезервеВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"

	Дано Я открываю основную форму регистра сведений "ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаВРезервеВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаКПередачеВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"

	Дано Я открываю основную форму регистра сведений "ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаписиСкладскогоЖурналаКПередачеВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗемельныеУчастки" 

	Дано Я открываю основную форму списка регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗемельныеУчастки"

	Дано Я открываю основную форму регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийОбщие" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийОбщие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийОбщие"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийОбщие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийПользовательские" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияКатегорийПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийПользовательские"

	Дано Я открываю основную форму регистра сведений "ЗначенияКатегорийПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияКатегорийПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыДокументовОснованийВладельцевЭД" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыДокументовОснованийВладельцевЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыДокументовОснованийВладельцевЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыДокументовОснованийВладельцевЭД"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыДокументовОснованийВладельцевЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыДокументовОснованийВладельцевЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыЗапросовНаПодключение" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыЗапросовНаПодключение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыЗапросовНаПодключение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыЗапросовНаПодключение"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыЗапросовНаПодключение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыЗапросовНаПодключение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификационныеДанныеПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификационныеДанныеПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификационныеДанныеПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификационныеДанныеПользователей"

	Дано Я открываю основную форму регистра сведений "ИдентификационныеДанныеПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификационныеДанныеПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИерархияПартнеров" 

	Дано Я открываю основную форму списка регистра сведений "ИерархияПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИерархияПартнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИерархияПартнеров"

	Дано Я открываю основную форму регистра сведений "ИерархияПартнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИерархияПартнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексыСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндексыСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексыСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндексыСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОграничениеСкоростиОтсылки" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОграничениеСкоростиОтсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОграничениеСкоростиОтсылки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОграничениеСкоростиОтсылки"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОграничениеСкоростиОтсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОграничениеСкоростиОтсылки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОткрытые" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОткрытые"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОтложенныеПроверки" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОтложенныеПроверки"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"

	Дано Я открываю основную форму регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхРасширенийВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияИзмененияФорматовМагазинов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияИзмененияФорматовМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияФорматовМагазинов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияИзмененияФорматовМагазинов"

	Дано Я открываю основную форму регистра сведений "ИсторияИзмененияФорматовМагазинов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияФорматовМагазинов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПодарочныхСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПодарочныхСертификатов"

	Дано Я открываю основную форму регистра сведений "ИсторияПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиДанныхВариантовАнализаЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиПервичногоИнтереса" 

	Дано Я открываю основную форму списка регистра сведений "ИсточникиПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиПервичногоИнтереса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиПервичногоИнтереса"

	Дано Я открываю основную форму регистра сведений "ИсточникиПервичногоИнтереса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсточникиПервичногоИнтереса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендарныеГрафики" 

	Дано Я открываю основную форму списка регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендарныеГрафики"

	Дано Я открываю основную форму регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыНеПередающиеДанныеВИСМП" 

	Дано Я открываю основную форму списка регистра сведений "КассыНеПередающиеДанныеВИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КассыНеПередающиеДанныеВИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыНеПередающиеДанныеВИСМП"

	Дано Я открываю основную форму регистра сведений "КассыНеПередающиеДанныеВИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КассыНеПередающиеДанныеВИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсий"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсийНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсийНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростые" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростые"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростыеНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростыеНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КвотыАссортимента" 

	Дано Я открываю основную форму списка регистра сведений "КвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КвотыАссортимента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КвотыАссортимента"

	Дано Я открываю основную форму регистра сведений "КвотыАссортимента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КвотыАссортимента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаВнешнихПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаВнешнихПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКОбъектам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКОбъектам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКРегистрам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКРегистрам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаНаборовГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаНаборовГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодировкиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодировкиФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодыТоваровПодключаемогоОборудованияOffline" 

	Дано Я открываю основную форму списка регистра сведений "КодыТоваровПодключаемогоОборудованияOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТоваровПодключаемогоОборудованияOffline"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыТоваровПодключаемогоОборудованияOffline"

	Дано Я открываю основную форму регистра сведений "КодыТоваровПодключаемогоОборудованияOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодыТоваровПодключаемогоОборудованияOffline"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоммерческиеПредложенияПоЗапросам" 

	Дано Я открываю основную форму списка регистра сведений "КоммерческиеПредложенияПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоммерческиеПредложенияПоЗапросам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоммерческиеПредложенияПоЗапросам"

	Дано Я открываю основную форму регистра сведений "КоммерческиеПредложенияПоЗапросам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоммерческиеПредложенияПоЗапросам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрагентыНаМониторингеСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "КонтрагентыНаМониторингеСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыНаМониторингеСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрагентыНаМониторингеСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "КонтрагентыНаМониторингеСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрагентыНаМониторингеСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольОтраженияВУчетеЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольОтраженияВУчетеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольОтраженияВУчетеЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольОтраженияВУчетеЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольОтраженияВУчетеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольОтраженияВУчетеЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольПроведенияУчетныхДокументовЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольПроведенияУчетныхДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольПроведенияУчетныхДокументовЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольПроведенияУчетныхДокументовЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольПроведенияУчетныхДокументовЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольПроведенияУчетныхДокументовЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрольСопоставленияНоменклатурыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "КонтрольСопоставленияНоменклатурыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольСопоставленияНоменклатурыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрольСопоставленияНоменклатурыЭДО"

	Дано Я открываю основную форму регистра сведений "КонтрольСопоставленияНоменклатурыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтрольСопоставленияНоменклатурыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорзинаПокупателя" 

	Дано Я открываю основную форму списка регистра сведений "КорзинаПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорзинаПокупателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорзинаПокупателя"

	Дано Я открываю основную форму регистра сведений "КорзинаПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорзинаПокупателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшДанныхПартионногоУчета" 

	Дано Я открываю основную форму списка регистра сведений "КэшДанныхПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхПартионногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшДанныхПартионногоУчета"

	Дано Я открываю основную форму регистра сведений "КэшДанныхПартионногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшДанныхПартионногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПрограммныхИнтерфейсов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПрограммныхИнтерфейсов"

	Дано Я открываю основную форму регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшСостоянийКонтрагентовФНС" 

	Дано Я открываю основную форму списка регистра сведений "КэшСостоянийКонтрагентовФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшСостоянийКонтрагентовФНС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшСостоянийКонтрагентовФНС"

	Дано Я открываю основную форму регистра сведений "КэшСостоянийКонтрагентовФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшСостоянийКонтрагентовФНС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшТестовыхПериодов" 

	Дано Я открываю основную форму списка регистра сведений "КэшТестовыхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшТестовыхПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшТестовыхПериодов"

	Дано Я открываю основную форму регистра сведений "КэшТестовыхПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшТестовыхПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийОчередьЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийОчередьЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийОчередьЗагрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийОчередьЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийОчередьЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийСостояниеВыгрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеВыгрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийСостояниеВыгрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийСостояниеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеВыгрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МиграцияПриложенийСостояниеЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "МиграцияПриложенийСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МиграцияПриложенийСостояниеЗагрузки"

	Дано Я открываю основную форму регистра сведений "МиграцияПриложенийСостояниеЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МиграцияПриложенийСостояниеЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеНовыхЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеНовыхЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеНовыхЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеНовыхЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НаличиеНовыхЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеНовыхЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаКонтроляОбеспечения" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаКонтроляОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаКонтроляОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаКонтроляОбеспечения"

	Дано Я открываю основную форму регистра сведений "НастройкаКонтроляОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаКонтроляОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаПередачиТоваровМеждуОрганизациями" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаПередачиТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаПередачиТоваровМеждуОрганизациями"

	Дано Я открываю основную форму регистра сведений "НастройкаПередачиТоваровМеждуОрганизациями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаПередачиТоваровМеждуОрганизациями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкаРаспределенияПоНаправлениямДеятельности" 

	Дано Я открываю основную форму списка регистра сведений "НастройкаРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкаРаспределенияПоНаправлениямДеятельности"

	Дано Я открываю основную форму регистра сведений "НастройкаРаспределенияПоНаправлениямДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкаРаспределенияПоНаправлениямДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиАвторизацииВ1СДокументообороте" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиАвторизацииВ1СДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАвторизацииВ1СДокументообороте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиАвторизацииВ1СДокументообороте"

	Дано Я открываю основную форму регистра сведений "НастройкиАвторизацииВ1СДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАвторизацииВ1СДокументообороте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиАдресныхСкладов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиАдресныхСкладов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАдресныхСкладов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиАдресныхСкладов"

	Дано Я открываю основную форму регистра сведений "НастройкиАдресныхСкладов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиАдресныхСкладов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаполненияДополнительныхПолей" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаполненияДополнительныхПолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияДополнительныхПолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаполненияДополнительныхПолей"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаполненияДополнительныхПолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаполненияДополнительныхПолей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОблачногоАрхиваНаЛокальномКомпьютере" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"

	Дано Я открываю основную форму регистра сведений "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаДаннымиXDTO" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаДаннымиXDTO"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаСУЗ" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаСУЗ"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОткрытияФормПриНачалеРаботыСистемы" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОткрытияФормПриНачалеРаботыСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОткрытияФормПриНачалеРаботыСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОткрытияФормПриНачалеРаботыСистемы"

	Дано Я открываю основную форму регистра сведений "НастройкиОткрытияФормПриНачалеРаботыСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОткрытияФормПриНачалеРаботыСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправителя" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправителя"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправкиЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправкиЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправкиЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправкиЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправкиЭлектронныхДокументовПоВидам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправкиЭлектронныхДокументовПоВидам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументовПоВидам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправкиЭлектронныхДокументовПоВидам"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправкиЭлектронныхДокументовПоВидам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправкиЭлектронныхДокументовПоВидам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОчисткиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПечатиОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПечатиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПечатиОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПечатиОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПечатиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПечатиОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПодключенияВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПодключенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодключенияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПодключенияВЕТИС"

	Дано Я открываю основную форму регистра сведений "НастройкиПодключенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодключенияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПолученияЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПолученияЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПолученияЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "НастройкиПолученияЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПолученияЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПользователейБИП" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПользователейБИП"

	Дано Я открываю основную форму регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаДанными"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластейДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластиДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаСообщениями" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаСообщениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаСообщениями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаСообщениями"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаСообщениями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаСообщениями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУполномоченногоГашенияВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУполномоченногоГашенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУполномоченногоГашенияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУполномоченногоГашенияВЕТИС"

	Дано Я открываю основную форму регистра сведений "НастройкиУполномоченногоГашенияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУполномоченногоГашенияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхСистем" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхСистем"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхСистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДССостояниеРеализации0" 

	Дано Я открываю основную форму списка регистра сведений "НДССостояниеРеализации0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДССостояниеРеализации0"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДССостояниеРеализации0"

	Дано Я открываю основную форму регистра сведений "НДССостояниеРеализации0"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДССостояниеРеализации0"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеразделенныеПользователи" 

	Дано Я открываю основную форму списка регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеразделенныеПользователи"

	Дано Я открываю основную форму регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураКонтрагентовБЭД" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураКонтрагентовБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураКонтрагентовБЭД"

	Дано Я открываю основную форму регистра сведений "НоменклатураКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураКонтрагентовБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПродаваемаяСовместно" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураПродаваемаяСовместно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураПродаваемаяСовместно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПродаваемаяСовместно"

	Дано Я открываю основную форму регистра сведений "НоменклатураПродаваемаяСовместно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураПродаваемаяСовместно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураСегмента" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураСегмента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураСегмента"

	Дано Я открываю основную форму регистра сведений "НоменклатураСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураСегмента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураТорговойПлощадки" 

	Дано Я открываю основную форму списка регистра сведений "НоменклатураТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураТорговойПлощадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураТорговойПлощадки"

	Дано Я открываю основную форму регистра сведений "НоменклатураТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НоменклатураТорговойПлощадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НормативыРаспределенияПлановПродажПоКатегориям" 

	Дано Я открываю основную форму списка регистра сведений "НормативыРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативыРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НормативыРаспределенияПлановПродажПоКатегориям"

	Дано Я открываю основную форму регистра сведений "НормативыРаспределенияПлановПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НормативыРаспределенияПлановПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НумерацияЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НумерацияЧековККТ"

	Дано Я открываю основную форму регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиДействияСертификатовНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДействияСертификатовНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДействияСертификатовНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиДействияСертификатовНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ОбластиДействияСертификатовНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДействияСертификатовНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиТребующиеОбработкиПоставляемыхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиТребующиеОбработкиПоставляемыхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаКДанным" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаКДанным"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаТекущиеЗадания" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаТекущиеЗадания"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыИнтегрированныеС1СДокументооборотом" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыИнтегрированныеС1СДокументооборотом"

	Дано Я открываю основную форму регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыКОтправке" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыКОтправке"

	Дано Я открываю основную форму регистра сведений "ОбъектыКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыКОтправке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыПроблемСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыПроблемСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыПроблемСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыПроблемСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ОбъектыПроблемСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыПроблемСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОператорыЭДО" 

	Дано Я открываю основную форму списка регистра сведений "ОператорыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОператорыЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОператорыЭДО"

	Дано Я открываю основную форму регистра сведений "ОператорыЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОператорыЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "ОрганизацииБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииБизнесСеть"

	Дано Я открываю основную форму регистра сведений "ОрганизацииБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганизацииДляОбменаГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОрганизацииДляОбменаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииДляОбменаГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганизацииДляОбменаГИСМ"

	Дано Я открываю основную форму регистра сведений "ОрганизацииДляОбменаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОрганизацииДляОбменаГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОриентирыАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОриентирыАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиНаБанковскихСчетахПоДаннымВыписок" 

	Дано Я открываю основную форму списка регистра сведений "ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиНаБанковскихСчетахПоДаннымВыписок"

	Дано Я открываю основную форму регистра сведений "ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиНаБанковскихСчетахПоДаннымВыписок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиПродукцииВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ОстаткиПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиПродукцииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиПродукцииВЕТИС"

	Дано Я открываю основную форму регистра сведений "ОстаткиПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОстаткиПродукцииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейОбщие" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейОбщие"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейПользовательские" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейПользовательские"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеЛентыНовостейДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеЛентыНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостейДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеЛентыНовостейДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОтключенныеЛентыНовостейДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостейДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеПанелиКонтекстныхНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеПанелиКонтекстныхНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеПанелиКонтекстныхНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеПанелиКонтекстныхНовостей"

	Дано Я открываю основную форму регистра сведений "ОтключенныеПанелиКонтекстныхНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеПанелиКонтекстныхНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаказовККорректировкеСтрокМерныхТоваров" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"

	Дано Я открываю основную форму регистра сведений "ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЗаказовККорректировкеСтрокМерныхТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПередачиДанныхГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПередачиДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПередачиДанныхГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПередачиДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПередачиДанныхЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПередачиДанныхЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПередачиДанныхЕГАИС"

	Дано Я открываю основную форму регистра сведений "ОчередьПередачиДанныхЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПередачиДанныхЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПереоформленияРасходныхОрдеров" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПереоформленияРасходныхОрдеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПереоформленияРасходныхОрдеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПереоформленияРасходныхОрдеров"

	Дано Я открываю основную форму регистра сведений "ОчередьПереоформленияРасходныхОрдеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПереоформленияРасходныхОрдеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПолученияДанныхГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПолученияДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияДанныхГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПолученияДанныхГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПолученияДанныхГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияДанныхГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьПолученияКвитанцийОФиксацииГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьПолученияКвитанцийОФиксацииГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияКвитанцийОФиксацииГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьПолученияКвитанцийОФиксацииГИСМ"

	Дано Я открываю основную форму регистра сведений "ОчередьПолученияКвитанцийОФиксацииГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьПолученияКвитанцийОФиксацииГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьРасширенийДляОповещений" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьРасширенийДляОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасширенийДляОповещений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьРасширенийДляОповещений"

	Дано Я открываю основную форму регистра сведений "ОчередьРасширенийДляОповещений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьРасширенийДляОповещений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСобытийДляОповещенийКлиентам" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСобытийДляОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСобытийДляОповещенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСобытийДляОповещенийКлиентам"

	Дано Я открываю основную форму регистра сведений "ОчередьСобытийДляОповещенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСобытийДляОповещенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийВ1СДокументооборот" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийВ1СДокументооборот"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийВЕТИС"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийИСМП" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийИСМП"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийОбменаСОфлайнОборудованием" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийОбменаСОфлайнОборудованием"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"

	Дано Я открываю основную форму регистра сведений "ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЧековККТ"

	Дано Я открываю основную форму регистра сведений "ОчередьЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьЧековККТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибкиРасчетаПартийИСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ОшибкиРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибкиРасчетаПартийИСебестоимости"

	Дано Я открываю основную форму регистра сведений "ОшибкиРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибкиРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОшибочныеРеквизитыКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "ОшибочныеРеквизитыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибочныеРеквизитыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОшибочныеРеквизитыКонтрагентов"

	Дано Я открываю основную форму регистра сведений "ОшибочныеРеквизитыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОшибочныеРеквизитыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыДляОтправки" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыДляОтправки"

	Дано Я открываю основную форму регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыИнформацииПриЗапуске"

	Дано Я открываю основную форму регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОграниченияДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОграниченияДоступа"

	Дано Я открываю основную форму регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыПрограммы" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыПрограммы"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартнерыСегмента" 

	Дано Я открываю основную форму списка регистра сведений "ПартнерыСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПартнерыСегмента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартнерыСегмента"

	Дано Я открываю основную форму регистра сведений "ПартнерыСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПартнерыСегмента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодическиеСвойстваНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодическиеСвойстваНовостей"

	Дано Я открываю основную форму регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоддерживаемыеФорматыЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ПоддерживаемыеФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоддерживаемыеФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоддерживаемыеФорматыЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "ПоддерживаемыеФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоддерживаемыеФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиПолучателей" 

	Дано Я открываю основную форму списка регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиПолучателей"

	Дано Я открываю основную форму регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодписываемыеВидыЭД" 

	Дано Я открываю основную форму списка регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодписываемыеВидыЭД"

	Дано Я открываю основную форму регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеОплатыНДСВБюджет" 

	Дано Я открываю основную форму списка регистра сведений "ПодтверждениеОплатыНДСВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодтверждениеОплатыНДСВБюджет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодтверждениеОплатыНДСВБюджет"

	Дано Я открываю основную форму регистра сведений "ПодтверждениеОплатыНДСВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодтверждениеОплатыНДСВБюджет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "ПользователиБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиБизнесСеть"

	Дано Я открываю основную форму регистра сведений "ПользователиБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокПлатежногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокПлатежногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокПлатежногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ПорядокПлатежногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокПлатежногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоследнийОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ПоследнийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследнийОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоследнийОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ПоследнийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоследнийОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанныеТребующиеОбработки" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанныеТребующиеОбработки"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваДоступаПользователейВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ПраваДоступаПользователейВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваДоступаПользователейВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваДоступаПользователейВЕТИС"

	Дано Я открываю основную форму регистра сведений "ПраваДоступаПользователейВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваДоступаПользователейВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваРолей"

	Дано Я открываю основную форму регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаДляОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаДляОбменаДанными"

	Дано Я открываю основную форму регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПреобразованияФорматов" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаПреобразованияФорматов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПреобразованияФорматов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПреобразованияФорматов"

	Дано Я открываю основную форму регистра сведений "ПравилаПреобразованияФорматов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаПреобразованияФорматов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаРазмещенияТоваровВЯчейках" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаРазмещенияТоваровВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаРазмещенияТоваровВЯчейках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаРазмещенияТоваровВЯчейках"

	Дано Я открываю основную форму регистра сведений "ПравилаРазмещенияТоваровВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаРазмещенияТоваровВЯчейках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредприятияЗонОтветственностиВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "ПредприятияЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредприятияЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредприятияЗонОтветственностиВЕТИС"

	Дано Я открываю основную форму регистра сведений "ПредприятияЗонОтветственностиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредприятияЗонОтветственностиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПривязкаНовостейКМетаданным" 

	Дано Я открываю основную форму списка регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПривязкаНовостейКМетаданным"

	Дано Я открываю основную форму регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриглашенияКОбменуЭлектроннымиДокументами" 

	Дано Я открываю основную форму списка регистра сведений "ПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриглашенияКОбменуЭлектроннымиДокументами"

	Дано Я открываю основную форму регистра сведений "ПриглашенияКОбменуЭлектроннымиДокументами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПриглашенияКОбменуЭлектроннымиДокументами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПримененияЕНВД" 

	Дано Я открываю основную форму списка регистра сведений "ПримененияЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененияЕНВД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПримененияЕНВД"

	Дано Я открываю основную форму регистра сведений "ПримененияЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПримененияЕНВД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныИзмененияАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроблемыСостоянияСистемы" 

	Дано Я открываю основную форму списка регистра сведений "ПроблемыСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроблемыСостоянияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроблемыСостоянияСистемы"

	Дано Я открываю основную форму регистра сведений "ПроблемыСостоянияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроблемыСостоянияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогнозыРасходаУпаковок" 

	Дано Я открываю основную форму списка регистра сведений "ПрогнозыРасходаУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозыРасходаУпаковок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрогнозыРасходаУпаковок"

	Дано Я открываю основную форму регистра сведений "ПрогнозыРасходаУпаковок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрогнозыРасходаУпаковок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПросмотренныеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПросмотренныеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПротоколыРасчетаПартийИСебестоимости" 

	Дано Я открываю основную форму списка регистра сведений "ПротоколыРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПротоколыРасчетаПартийИСебестоимости"

	Дано Я открываю основную форму регистра сведений "ПротоколыРасчетаПартийИСебестоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыРасчетаПартийИСебестоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентныеСтавкиФинансовыхИнструментов" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентныеСтавкиФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентныеСтавкиФинансовыхИнструментов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентныеСтавкиФинансовыхИнструментов"

	Дано Я открываю основную форму регистра сведений "ПроцентныеСтавкиФинансовыхИнструментов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентныеСтавкиФинансовыхИнструментов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцессыДляЗапуска" 

	Дано Я открываю основную форму списка регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПсевдонимыПредопределенныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПсевдонимыПредопределенныхУзлов"

	Дано Я открываю основную форму регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубличныеИдентификаторыСинхронизируемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПулКодовМаркировкиСУЗ" 

	Дано Я открываю основную форму списка регистра сведений "ПулКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПулКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПулКодовМаркировкиСУЗ"

	Дано Я открываю основную форму регистра сведений "ПулКодовМаркировкиСУЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПулКодовМаркировкиСУЗ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux" 

	Дано Я открываю основную форму списка регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмещениеНоменклатурыПоСкладскимЯчейкам" 

	Дано Я открываю основную форму списка регистра сведений "РазмещениеНоменклатурыПоСкладскимЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмещениеНоменклатурыПоСкладскимЯчейкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмещениеНоменклатурыПоСкладскимЯчейкам"

	Дано Я открываю основную форму регистра сведений "РазмещениеНоменклатурыПоСкладскимЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмещениеНоменклатурыПоСкладскимЯчейкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенныеДляРедактированияЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенныеДляРедактированияЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_ДляОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_ДляОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Общие" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Общие"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Пользовательские" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Пользовательские"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСебестоимостиДатыКорректировокОстатков" 

	Дано Я открываю основную форму списка регистра сведений "РасчетСебестоимостиДатыКорректировокОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСебестоимостиДатыКорректировокОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСебестоимостиДатыКорректировокОстатков"

	Дано Я открываю основную форму регистра сведений "РасчетСебестоимостиДатыКорректировокОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетСебестоимостиДатыКорректировокОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка регистра сведений "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму регистра сведений "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентныеЗаданияЗакрытияМесяца" 

	Дано Я открываю основную форму списка регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентныеЗаданияЗакрытияМесяца"

	Дано Я открываю основную форму регистра сведений "РегламентныеЗаданияЗакрытияМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РегламентныеЗаданияЗакрытияМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДокументов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДокументов"

	Дано Я открываю основную форму регистра сведений "РеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулей" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулей"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервныеКопииОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "РезервныеКопииОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезервныеКопииОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервныеКопииОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "РезервныеКопииОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезервныеКопииОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыШтрихкодовУпаковокТоваровВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"

	Дано Я открываю основную форму регистра сведений "РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыШтрихкодовУпаковокТоваровВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РучныеИзмененияГрафиковРаботы" 

	Дано Я открываю основную форму списка регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РучныеИзмененияГрафиковРаботы"

	Дано Я открываю основную форму регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСертификатахОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСертификатахОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОФайлах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОФайлах"

	Дано Я открываю основную форму регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваЗаданий"

	Дано Я открываю основную форму регистра сведений "СвойстваЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваКонтрагентовСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваКонтрагентовСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваКонтрагентовСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваКонтрагентовСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "СвойстваКонтрагентовСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваКонтрагентовСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваНовостей" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваНовостей"

	Дано Я открываю основную форму регистра сведений "СвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваХранилищаОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваХранилищаОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваХранилищаОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваХранилищаОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "СвойстваХранилищаОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваХранилищаОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязанныеОбъектыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СвязанныеОбъектыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязанныеОбъектыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СвязанныеОбъектыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиМеждуПартнерами" 

	Дано Я открываю основную форму списка регистра сведений "СвязиМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуПартнерами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиМеждуПартнерами"

	Дано Я открываю основную форму регистра сведений "СвязиМеждуПартнерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуПартнерами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиМеждуФизЛицами" 

	Дано Я открываю основную форму списка регистра сведений "СвязиМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуФизЛицами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиМеждуФизЛицами"

	Дано Я открываю основную форму регистра сведений "СвязиМеждуФизЛицами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиМеждуФизЛицами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязьВидовИФорматовЭД" 

	Дано Я открываю основную форму списка регистра сведений "СвязьВидовИФорматовЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязьВидовИФорматовЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязьВидовИФорматовЭД"

	Дано Я открываю основную форму регистра сведений "СвязьВидовИФорматовЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязьВидовИФорматовЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СеансыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СеансыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СезонныеКоэффициенты" 

	Дано Я открываю основную форму списка регистра сведений "СезонныеКоэффициенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СезонныеКоэффициенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СезонныеКоэффициенты"

	Дано Я открываю основную форму регистра сведений "СезонныеКоэффициенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СезонныеКоэффициенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыУчетныхЗаписейЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыУчетныхЗаписейЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыУчетныхЗаписейЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыУчетныхЗаписейЭДО"

	Дано Я открываю основную форму регистра сведений "СертификатыУчетныхЗаписейЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыУчетныхЗаписейЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыШифрования" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыШифрования"

	Дано Я открываю основную форму регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СессииОбменаСообщениямиСистемы" 

	Дано Я открываю основную форму списка регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СессииОбменаСообщениямиСистемы"

	Дано Я открываю основную форму регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СинхронизацияКлассификаторовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СинхронизацияКлассификаторовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияКлассификаторовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СинхронизацияКлассификаторовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СинхронизацияКлассификаторовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияКлассификаторовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СинхронизацияОбъектовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СинхронизацияОбъектовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияОбъектовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СинхронизацияОбъектовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СинхронизацияОбъектовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СинхронизацияОбъектовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СлужебныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияМониторингаСПАРКРиски" 

	Дано Я открываю основную форму списка регистра сведений "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияМониторингаСПАРКРиски"

	Дано Я открываю основную форму регистра сведений "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СовместимостьОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СовместимостьОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СовместимостьОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СовместимостьОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "СовместимостьОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СовместимостьОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДанными"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеВидовНоменклатурыРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеВидовНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеЗначенийРеквизитовБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеЗначенийРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеЗначенийРеквизитовБизнесСеть"

	Дано Я открываю основную форму регистра сведений "СоответствиеЗначенийРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеЗначенийРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыБизнесСеть"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыВЕТИС"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыЕГАИС"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеНоменклатурыРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеНоменклатурыРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеНоменклатурыРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеНоменклатурыРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеРеквизитовБизнесСеть" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовБизнесСеть"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеРеквизитовБизнесСеть"

	Дано Я открываю основную форму регистра сведений "СоответствиеРеквизитовБизнесСеть"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовБизнесСеть"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеРеквизитовРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеРеквизитовРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "СоответствиеРеквизитовРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеРеквизитовРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы" 

	Дано Я открываю основную форму списка регистра сведений "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"

	Дано Я открываю основную форму регистра сведений "СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствиеУсловийПродажМобильногоПриложения1СЗаказы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставныеФайлы" 

	Дано Я открываю основную форму списка регистра сведений "СоставныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставныеФайлы"

	Дано Я открываю основную форму регистра сведений "СоставныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеОрганизацийБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеОрганизацийБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОрганизацийБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеОрганизацийБЭД"

	Дано Я открываю основную форму регистра сведений "СостояниеОрганизацийБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеОрганизацийБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеПодписанияЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеПодписанияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодписанияЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеПодписанияЭД"

	Дано Я открываю основную форму регистра сведений "СостояниеПодписанияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеПодписанияЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияБлокировкиВычетаНДСПоСчетамФактурам" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияБлокировкиВычетаНДСПоСчетамФактурам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияБлокировкиВычетаНДСПоСчетамФактурам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияБлокировкиВычетаНДСПоСчетамФактурам"

	Дано Я открываю основную форму регистра сведений "СостоянияБлокировкиВычетаНДСПоСчетамФактурам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияБлокировкиВычетаНДСПоСчетамФактурам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВнутреннихЗаказов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВнутреннихЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВнутреннихЗаказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВнутреннихЗаказов"

	Дано Я открываю основную форму регистра сведений "СостоянияВнутреннихЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВнутреннихЗаказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовКлиентов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовКлиентов"

	Дано Я открываю основную форму регистра сведений "СостоянияЗаказовКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовПоставщикам" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовПоставщикам"

	Дано Я открываю основную форму регистра сведений "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗапросовКоммерческихПредложений" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЗапросовКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗапросовКоммерческихПредложений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗапросовКоммерческихПредложений"

	Дано Я открываю основную форму регистра сведений "СостоянияЗапросовКоммерческихПредложений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЗапросовКоммерческихПредложений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияИнтеграцииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияИнтеграцииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИнтеграцииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияИнтеграцииОбъектов"

	Дано Я открываю основную форму регистра сведений "СостоянияИнтеграцииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИнтеграцииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияИРеквизитыДоставки" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияИРеквизитыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИРеквизитыДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияИРеквизитыДоставки"

	Дано Я открываю основную форму регистра сведений "СостоянияИРеквизитыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияИРеквизитыДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКоммерческихПредложенийКлиентам" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКоммерческихПредложенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКоммерческихПредложенийКлиентам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКоммерческихПредложенийКлиентам"

	Дано Я открываю основную форму регистра сведений "СостоянияКоммерческихПредложенийКлиентам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКоммерческихПредложенийКлиентам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтрагентов"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтрагентовБЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентовБЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтрагентовБЭД"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтрагентовБЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтрагентовБЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияНовостей"

	Дано Я открываю основную форму регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовССайтом" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовССайтом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовССайтом"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовССайтом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовЭДЧерезОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовЭДЧерезОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПапокПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПересчетовЯчеек" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПересчетовЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПересчетовЯчеек"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПересчетовЯчеек"

	Дано Я открываю основную форму регистра сведений "СостоянияПересчетовЯчеек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПересчетовЯчеек"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСинхронизацииСервисНастроекЭДО" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСинхронизацииСервисНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииСервисНастроекЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСинхронизацииСервисНастроекЭДО"

	Дано Я открываю основную форму регистра сведений "СостоянияСинхронизацииСервисНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииСервисНастроекЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСинхронизацииТорговыеПредложения" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСинхронизацииТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииТорговыеПредложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСинхронизацииТорговыеПредложения"

	Дано Я открываю основную форму регистра сведений "СостоянияСинхронизацииТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСинхронизацииТорговыеПредложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСогласованияВДокументообороте" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСогласованияВДокументообороте"

	Дано Я открываю основную форму регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЭД" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЭД"

	Дано Я открываю основную форму регистра сведений "СостоянияЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаКонфигурации" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаКонфигурации"

	Дано Я открываю основную форму регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаСделокСКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСделокСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаСделокСКлиентами"

	Дано Я открываю основную форму регистра сведений "СтатистикаСделокСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаСделокСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусОбменовСЯндексКассой" 

	Дано Я открываю основную форму списка регистра сведений "СтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусОбменовСЯндексКассой"

	Дано Я открываю основную форму регистра сведений "СтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовЕГАИС"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗапросовДляПоиска" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗапросовДляПоиска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовДляПоиска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗапросовДляПоиска"

	Дано Я открываю основную форму регистра сведений "СтатусыЗапросовДляПоиска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗапросовДляПоиска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗаявокНаВыпускКиЗГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗаявокНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗаявокНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗаявокНаВыпускКиЗГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыЗаявокНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗаявокНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыИнформированияГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыИнформированияГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыИнформированияГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыИнформированияГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыИнформированияГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыИнформированияГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовВЕТИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовВЕТИС"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовЕГАИС"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОформленияДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОформленияДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОформленияДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыОформленияДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОформленияДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыПроверкиИПодбораДокументовИСМП" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыПроверкиИПодбораДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиИПодбораДокументовИСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыПроверкиИПодбораДокументовИСМП"

	Дано Я открываю основную форму регистра сведений "СтатусыПроверкиИПодбораДокументовИСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыПроверкиИПодбораДокументовИСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму регистра сведений "СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыУведомленийОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтоимостьТоваров" 

	Дано Я открываю основную форму списка регистра сведений "СтоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтоимостьТоваров"

	Дано Я открываю основную форму регистра сведений "СтоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СубъектыДляСкрытияПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СубъектыДляСкрытияПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СуммыДокументовВВалютеРегл" 

	Дано Я открываю основную форму списка регистра сведений "СуммыДокументовВВалютеРегл"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СуммыДокументовВВалютеРегл"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СуммыДокументовВВалютеРегл"

	Дано Я открываю основную форму регистра сведений "СуммыДокументовВВалютеРегл"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СуммыДокументовВВалютеРегл"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СхемыОбеспечения" 

	Дано Я открываю основную форму списка регистра сведений "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СхемыОбеспечения"

	Дано Я открываю основную форму регистра сведений "СхемыОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СхемыОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаФактурыКомиссионерамКОформлению" 

	Дано Я открываю основную форму списка регистра сведений "СчетаФактурыКомиссионерамКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомиссионерамКОформлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаФактурыКомиссионерамКОформлению"

	Дано Я открываю основную форму регистра сведений "СчетаФактурыКомиссионерамКОформлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомиссионерамКОформлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетаФактурыКомитентовКРегистрации" 

	Дано Я открываю основную форму списка регистра сведений "СчетаФактурыКомитентовКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомитентовКРегистрации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетаФактурыКомитентовКРегистрации"

	Дано Я открываю основную форму регистра сведений "СчетаФактурыКомитентовКРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетаФактурыКомитентовКРегистрации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТикетыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТикетыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеОграничения" 

	Дано Я открываю основную форму списка регистра сведений "ТоварныеОграничения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварныеОграничения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеОграничения"

	Дано Я открываю основную форму регистра сведений "ТоварныеОграничения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварныеОграничения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыДругогоКачества" 

	Дано Я открываю основную форму списка регистра сведений "ТоварыДругогоКачества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыДругогоКачества"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыДругогоКачества"

	Дано Я открываю основную форму регистра сведений "ТоварыДругогоКачества"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыДругогоКачества"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКДоставке" 

	Дано Я открываю основную форму списка регистра сведений "ТоварыКДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыКДоставке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКДоставке"

	Дано Я открываю основную форму регистра сведений "ТоварыКДоставке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТоварыКДоставке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТорговыеПредложенияТорговойПлощадки" 

	Дано Я открываю основную форму списка регистра сведений "ТорговыеПредложенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТорговыеПредложенияТорговойПлощадки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТорговыеПредложенияТорговойПлощадки"

	Дано Я открываю основную форму регистра сведений "ТорговыеПредложенияТорговойПлощадки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТорговыеПредложенияТорговойПлощадки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТребуетсяОформлениеСчетаФактуры" 

	Дано Я открываю основную форму списка регистра сведений "ТребуетсяОформлениеСчетаФактуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяОформлениеСчетаФактуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТребуетсяОформлениеСчетаФактуры"

	Дано Я открываю основную форму регистра сведений "ТребуетсяОформлениеСчетаФактуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТребуетсяОформлениеСчетаФактуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Удалить_АктивныеПредметыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Удалить_АктивныеПредметыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьБлокировкиСеансовОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьБлокировкиСеансовОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВерсииКлассификаторовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВерсииКлассификаторовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииКлассификаторовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииКлассификаторовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"

	Дано Я открываю основную форму регистра сведений "УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗаданияКРаспределениюТоваровОрганизацийНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени2" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени2"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени3" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени3"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиТранспортаОбмена" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиТранспортаОбмена"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНовыеДокументыВСервисеЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНовыеДокументыВСервисеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНовыеДокументыВСервисеЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНовыеДокументыВСервисеЭДО"

	Дано Я открываю основную форму регистра сведений "УдалитьНовыеДокументыВСервисеЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНовыеДокументыВСервисеЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиКРезервномуКопированию" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиКРезервномуКопированию"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьЗаданий"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыИнтернетПоддержкиПользователей" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИнтернетПоддержкиПользователей"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПраваПоЗначениямДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПраваПоЗначениямДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПротоколОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПротоколОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПротоколОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "УдалитьПротоколОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПротоколОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРеестрДокументов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРеестрДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРеестрДокументов"

	Дано Я открываю основную форму регистра сведений "УдалитьРеестрДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРеестрДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоответствиеПоискаРаботаСНоменклатурой" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоответствиеПоискаРаботаСНоменклатурой"

	Дано Я открываю основную форму регистра сведений "УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоответствиеПоискаРаботаСНоменклатурой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтатусОбменовСЯндексКассой" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтатусОбменовСЯндексКассой"

	Дано Я открываю основную форму регистра сведений "УдалитьСтатусОбменовСЯндексКассой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусОбменовСЯндексКассой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтраныМира" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтраныМира"

	Дано Я открываю основную форму регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"

	Дано Я открываю основную форму регистра сведений "УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьУчастникиОбменовЭДЧерезОператоровЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФорматыОбменаЕГАИС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФорматыОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФорматыОбменаЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФорматыОбменаЕГАИС"

	Дано Я открываю основную форму регистра сведений "УдалитьФорматыОбменаЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФорматыОбменаЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниСокращенийАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УспешныеОбменыССайтом" 

	Дано Я открываю основную форму списка регистра сведений "УспешныеОбменыССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УспешныеОбменыССайтом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УспешныеОбменыССайтом"

	Дано Я открываю основную форму регистра сведений "УспешныеОбменыССайтом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УспешныеОбменыССайтом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстаревшиеВидыЗапасовСОстатками" 

	Дано Я открываю основную форму списка регистра сведений "УстаревшиеВидыЗапасовСОстатками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УстаревшиеВидыЗапасовСОстатками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстаревшиеВидыЗапасовСОстатками"

	Дано Я открываю основную форму регистра сведений "УстаревшиеВидыЗапасовСОстатками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УстаревшиеВидыЗапасовСОстатками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаОрганизаций"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭДО" 

	Дано Я открываю основную форму списка регистра сведений "УчетныеЗаписиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетныеЗаписиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭДО"

	Дано Я открываю основную форму регистра сведений "УчетныеЗаписиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетныеЗаписиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ФайлыОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФИОФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФИОФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФискальныеОперации" 

	Дано Я открываю основную форму списка регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФискальныеОперации"

	Дано Я открываю основную форму регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыДляПреобразования" 

	Дано Я открываю основную форму списка регистра сведений "ФорматыДляПреобразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыДляПреобразования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыДляПреобразования"

	Дано Я открываю основную форму регистра сведений "ФорматыДляПреобразования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыДляПреобразования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФорматыЭлектронныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФорматыЭлектронныхДокументов"

	Дано Я открываю основную форму регистра сведений "ФорматыЭлектронныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФорматыЭлектронныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеСертификатов"

	Дано Я открываю основную форму регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелевыеЗначенияВариантовАнализа" 

	Дано Я открываю основную форму списка регистра сведений "ЦелевыеЗначенияВариантовАнализа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦелевыеЗначенияВариантовАнализа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелевыеЗначенияВариантовАнализа"

	Дано Я открываю основную форму регистра сведений "ЦелевыеЗначенияВариантовАнализа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦелевыеЗначенияВариантовАнализа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныНоменклатурыПоставщиков" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныНоменклатурыПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатурыПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныНоменклатурыПоставщиков"

	Дано Я открываю основную форму регистра сведений "ЦеныНоменклатурыПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныНоменклатурыПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтрихкодыНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "ШтрихкодыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтрихкодыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтрихкодыНоменклатуры"

	Дано Я открываю основную форму регистра сведений "ШтрихкодыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШтрихкодыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПодписи" 

	Дано Я открываю основную форму списка регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныеПодписи"

	Дано Я открываю основную форму регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БонусныеБаллы" 

	Дано Я открываю основную форму списка регистра накопления "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БонусныеБаллы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БонусныеБаллы"

	Дано Я открываю основную форму регистра накопления "БонусныеБаллы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БонусныеБаллы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыручкаИСебестоимостьПродаж" 

	Дано Я открываю основную форму списка регистра накопления "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыручкаИСебестоимостьПродаж"

	Дано Я открываю основную форму регистра накопления "ВыручкаИСебестоимостьПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыручкаИСебестоимостьПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОтгрузкиТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ГрафикОтгрузкиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикОтгрузкиТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОтгрузкиТоваров"

	Дано Я открываю основную форму регистра накопления "ГрафикОтгрузкиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикОтгрузкиТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикПоступленияТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ГрафикПоступленияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикПоступленияТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикПоступленияТоваров"

	Дано Я открываю основную форму регистра накопления "ГрафикПоступленияТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикПоступленияТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвижениеТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ДвижениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвижениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвижениеТоваров"

	Дано Я открываю основную форму регистра накопления "ДвижениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвижениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныеСредстваДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныеСредстваДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныеСредстваДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныеСредстваДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныеСредстваКонтрагент" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныеСредстваКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваКонтрагент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныеСредстваКонтрагент"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныеСредстваКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныеСредстваКонтрагент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДенежныхСредств" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДенежныхСредств"

	Дано Я открываю основную форму регистра накопления "ДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияДоходыРасходыПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияДоходыРасходыПрочиеАктивыПассивы"

	Дано Я открываю основную форму регистра накопления "ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияДоходыРасходыПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияКонтрагентДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияКонтрагентДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияКонтрагентДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияКонтрагентДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияКонтрагентКонтрагент" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияКонтрагентКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентКонтрагент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияКонтрагентКонтрагент"

	Дано Я открываю основную форму регистра накопления "ДвиженияКонтрагентКонтрагент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияКонтрагентКонтрагент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияНоменклатураДоходыРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияНоменклатураДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияНоменклатураДоходыРасходы"

	Дано Я открываю основную форму регистра накопления "ДвиженияНоменклатураДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияНоменклатураНоменклатура" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияНоменклатураНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураНоменклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияНоменклатураНоменклатура"

	Дано Я открываю основную форму регистра накопления "ДвиженияНоменклатураНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияНоменклатураНоменклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвиженияСерийТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ДвиженияСерийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияСерийТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвиженияСерийТоваров"

	Дано Я открываю основную форму регистра накопления "ДвиженияСерийТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДвиженияСерийТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваБезналичные" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваБезналичные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваБезналичные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваБезналичные"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваБезналичные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваБезналичные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваВКассахККМ" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВКассахККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваВКассахККМ"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВКассахККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваВПути" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваВПути"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВПути"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваВПути"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваВПути"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваВПути"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваКВыплате" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваКВыплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваКВыплате"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваКВыплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваНаличные" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваНаличные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваНаличные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваНаличные"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваНаличные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваНаличные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДенежныеСредстваУПодотчетныхЛиц" 

	Дано Я открываю основную форму списка регистра накопления "ДенежныеСредстваУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваУПодотчетныхЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДенежныеСредстваУПодотчетныхЛиц"

	Дано Я открываю основную форму регистра накопления "ДенежныеСредстваУПодотчетныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДенежныеСредстваУПодотчетныхЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияПартийТоваровДляНДСиУСН" 

	Дано Я открываю основную форму списка регистра накопления "ДетализацияПартийТоваровДляНДСиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияПартийТоваровДляНДСиУСН"

	Дано Я открываю основную форму регистра накопления "ДетализацияПартийТоваровДляНДСиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДетализацияПартийТоваровДляНДСиУСН2_4" 

	Дано Я открываю основную форму списка регистра накопления "ДетализацияПартийТоваровДляНДСиУСН2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН2_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДетализацияПартийТоваровДляНДСиУСН2_4"

	Дано Я открываю основную форму регистра накопления "ДетализацияПартийТоваровДляНДСиУСН2_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДетализацияПартийТоваровДляНДСиУСН2_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыКлиентов"

	Дано Я открываю основную форму регистра накопления "ЗаказыКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаВнутреннееПотребление"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаПеремещение" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаПеремещение"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыНаСборку" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаСборку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыНаСборку"

	Дано Я открываю основную форму регистра накопления "ЗаказыНаСборку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыНаСборку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказыПоставщикам" 

	Дано Я открываю основную форму списка регистра накопления "ЗаказыПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказыПоставщикам"

	Дано Я открываю основную форму регистра накопления "ЗаказыПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаказыПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закупки" 

	Дано Я открываю основную форму списка регистра накопления "Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Закупки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закупки"

	Дано Я открываю основную форму регистра накопления "Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Закупки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкиНаВозвратТоваровОтКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ЗаявкиНаВозвратТоваровОтКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаявкиНаВозвратТоваровОтКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкиНаВозвратТоваровОтКлиентов"

	Дано Я открываю основную форму регистра накопления "ЗаявкиНаВозвратТоваровОтКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗаявкиНаВозвратТоваровОтКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитыРасходаДенежныхСредств" 

	Дано Я открываю основную форму списка регистра накопления "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитыРасходаДенежныхСредств"

	Дано Я открываю основную форму регистра накопления "ЛимитыРасходаДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЛимитыРасходаДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериалыИРаботыВПроизводстве" 

	Дано Я открываю основную форму списка регистра накопления "МатериалыИРаботыВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления МатериалыИРаботыВПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериалыИРаботыВПроизводстве"

	Дано Я открываю основную форму регистра накопления "МатериалыИРаботыВПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления МатериалыИРаботыВПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСЗаписиКнигиПокупок" 

	Дано Я открываю основную форму списка регистра накопления "НДСЗаписиКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПокупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСЗаписиКнигиПокупок"

	Дано Я открываю основную форму регистра накопления "НДСЗаписиКнигиПокупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПокупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСЗаписиКнигиПродаж" 

	Дано Я открываю основную форму списка регистра накопления "НДСЗаписиКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСЗаписиКнигиПродаж"

	Дано Я открываю основную форму регистра накопления "НДСЗаписиКнигиПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСЗаписиКнигиПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДСПредъявленный" 

	Дано Я открываю основную форму списка регистра накопления "НДСПредъявленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСПредъявленный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДСПредъявленный"

	Дано Я открываю основную форму регистра накопления "НДСПредъявленный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДСПредъявленный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбеспечениеЗаказов" 

	Дано Я открываю основную форму списка регистра накопления "ОбеспечениеЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеЗаказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбеспечениеЗаказов"

	Дано Я открываю основную форму регистра накопления "ОбеспечениеЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеЗаказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбеспечениеЗаказовРаботами" 

	Дано Я открываю основную форму списка регистра накопления "ОбеспечениеЗаказовРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеЗаказовРаботами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбеспечениеЗаказовРаботами"

	Дано Я открываю основную форму регистра накопления "ОбеспечениеЗаказовРаботами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОбеспечениеЗаказовРаботами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка регистра накопления "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму регистра накопления "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииЗатратНаВыпуск" 

	Дано Я открываю основную форму списка регистра накопления "ПартииЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииЗатратНаВыпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииЗатратНаВыпуск"

	Дано Я открываю основную форму регистра накопления "ПартииЗатратНаВыпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииЗатратНаВыпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииПроизводственныхЗатрат" 

	Дано Я открываю основную форму списка регистра накопления "ПартииПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПроизводственныхЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииПроизводственныхЗатрат"

	Дано Я открываю основную форму регистра накопления "ПартииПроизводственныхЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПроизводственныхЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииПрочихРасходов" 

	Дано Я открываю основную форму списка регистра накопления "ПартииПрочихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПрочихРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииПрочихРасходов"

	Дано Я открываю основную форму регистра накопления "ПартииПрочихРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииПрочихРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииРасходовНаСебестоимостьТоваров" 

	Дано Я открываю основную форму списка регистра накопления "ПартииРасходовНаСебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииРасходовНаСебестоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииРасходовНаСебестоимостьТоваров"

	Дано Я открываю основную форму регистра накопления "ПартииРасходовНаСебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииРасходовНаСебестоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ПартииТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТоваровОрганизаций"

	Дано Я открываю основную форму регистра накопления "ПартииТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииТоваровПереданныеНаКомиссию" 

	Дано Я открываю основную форму списка регистра накопления "ПартииТоваровПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровПереданныеНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииТоваровПереданныеНаКомиссию"

	Дано Я открываю основную форму регистра накопления "ПартииТоваровПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПартииТоваровПереданныеНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереданнаяВозвратнаяТара" 

	Дано Я открываю основную форму списка регистра накопления "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереданнаяВозвратнаяТара"

	Дано Я открываю основную форму регистра накопления "ПереданнаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПереданнаяВозвратнаяТара"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыЗакупок" 

	Дано Я открываю основную форму списка регистра накопления "ПланыЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗакупок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыЗакупок"

	Дано Я открываю основную форму регистра накопления "ПланыЗакупок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыЗакупок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОплатКлиентов" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОплатКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатКлиентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОплатКлиентов"

	Дано Я открываю основную форму регистра накопления "ПланыОплатКлиентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатКлиентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОплатПоставщикам" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОплатПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОплатПоставщикам"

	Дано Я открываю основную форму регистра накопления "ПланыОплатПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОплатПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыОстатков" 

	Дано Я открываю основную форму списка регистра накопления "ПланыОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыОстатков"

	Дано Я открываю основную форму регистра накопления "ПланыОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПотребленияКомплектующих" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПотребленияКомплектующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияКомплектующих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПотребленияКомплектующих"

	Дано Я открываю основную форму регистра накопления "ПланыПотребленияКомплектующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПотребленияКомплектующих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПродаж" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПродаж"

	Дано Я открываю основную форму регистра накопления "ПланыПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыПродажПоКатегориям" 

	Дано Я открываю основную форму списка регистра накопления "ПланыПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродажПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыПродажПоКатегориям"

	Дано Я открываю основную форму регистра накопления "ПланыПродажПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыПродажПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланыСборкиРазборки" 

	Дано Я открываю основную форму списка регистра накопления "ПланыСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыСборкиРазборки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланыСборкиРазборки"

	Дано Я открываю основную форму регистра накопления "ПланыСборкиРазборки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПланыСборкиРазборки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодарочныеСертификаты" 

	Дано Я открываю основную форму списка регистра накопления "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПодарочныеСертификаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодарочныеСертификаты"

	Дано Я открываю основную форму регистра накопления "ПодарочныеСертификаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПодарочныеСертификаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятаяВозвратнаяТара" 

	Дано Я открываю основную форму списка регистра накопления "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятаяВозвратнаяТара"

	Дано Я открываю основную форму регистра накопления "ПринятаяВозвратнаяТара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПринятаяВозвратнаяТара"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеАктивыПассивы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеАктивыПассивы"

	Дано Я открываю основную форму регистра накопления "ПрочиеАктивыПассивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеАктивыПассивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеДоходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеДоходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходы"

	Дано Я открываю основную форму регистра накопления "ПрочиеДоходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеДоходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка регистра накопления "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму регистра накопления "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыПоФинансовымИнструментам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоФинансовымИнструментам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыПоФинансовымИнструментам"

	Дано Я открываю основную форму регистра накопления "РасчетыПоФинансовымИнструментам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоФинансовымИнструментам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыПоЭквайрингу" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоЭквайрингу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыПоЭквайрингу"

	Дано Я открываю основную форму регистра накопления "РасчетыПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыПоЭквайрингу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентами" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентами"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПланОплат" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПланОплат"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПланОтгрузок" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПланОтгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОтгрузок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПланОтгрузок"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПланОтгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПланОтгрузок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПоДокументам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПоДокументам"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСКлиентамиПоСрокам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСКлиентамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоСрокам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСКлиентамиПоСрокам"

	Дано Я открываю основную форму регистра накопления "РасчетыСКлиентамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСКлиентамиПоСрокам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщиками" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщиками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщиками"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщиками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПланОплат" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланОплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПланОплат"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПланОплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланОплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПланПоставок" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПланПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланПоставок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПланПоставок"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПланПоставок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПланПоставок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПоДокументам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПоДокументам"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПоДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСПоставщикамиПоСрокам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСПоставщикамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоСрокам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСПоставщикамиПоСрокам"

	Дано Я открываю основную форму регистра накопления "РасчетыСПоставщикамиПоСрокам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСПоставщикамиПоСрокам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервыТоваровОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "РезервыТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыТоваровОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервыТоваровОрганизаций"

	Дано Я открываю основную форму регистра накопления "РезервыТоваровОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РезервыТоваровОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвободныеОстатки" 

	Дано Я открываю основную форму списка регистра накопления "СвободныеОстатки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СвободныеОстатки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвободныеОстатки"

	Дано Я открываю основную форму регистра накопления "СвободныеОстатки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СвободныеОстатки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СебестоимостьТоваров" 

	Дано Я открываю основную форму списка регистра накопления "СебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СебестоимостьТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СебестоимостьТоваров"

	Дано Я открываю основную форму регистра накопления "СебестоимостьТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СебестоимостьТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТМЦВЭксплуатации" 

	Дано Я открываю основную форму списка регистра накопления "ТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТМЦВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТМЦВЭксплуатации"

	Дано Я открываю основную форму регистра накопления "ТМЦВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТМЦВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеМестаКОтражениюИзлишковНедостач" 

	Дано Я открываю основную форму списка регистра накопления "ТоварныеМестаКОтражениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеМестаКОтражениюИзлишковНедостач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеМестаКОтражениюИзлишковНедостач"

	Дано Я открываю основную форму регистра накопления "ТоварныеМестаКОтражениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеМестаКОтражениюИзлишковНедостач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыВЯчейках" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыВЯчейках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыВЯчейках"

	Дано Я открываю основную форму регистра накопления "ТоварыВЯчейках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыВЯчейках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОтбору" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтбору"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОтбору"

	Дано Я открываю основную форму регистра накопления "ТоварыКОтбору"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтбору"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОтгрузке" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтгрузке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОтгрузке"

	Дано Я открываю основную форму регистра накопления "ТоварыКОтгрузке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОтгрузке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюЗаявленийОВвозе" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюЗаявленийОВвозе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюЗаявленийОВвозе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюЗаявленийОВвозе"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюЗаявленийОВвозе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюЗаявленийОВвозе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюИзлишковНедостач" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюИзлишковНедостач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюИзлишковНедостач"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюИзлишковНедостач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюИзлишковНедостач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюОтчетовКомитенту" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюОтчетовКомитенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюОтчетовКомитенту"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюОтчетовКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюОтчетовКомитенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКОформлениюТаможенныхДеклараций" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКОформлениюТаможенныхДеклараций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюТаможенныхДеклараций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКОформлениюТаможенныхДеклараций"

	Дано Я открываю основную форму регистра накопления "ТоварыКОформлениюТаможенныхДеклараций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКОформлениюТаможенныхДеклараций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыКПоступлению" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКПоступлению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыКПоступлению"

	Дано Я открываю основную форму регистра накопления "ТоварыКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыКПоступлению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыНаСкладах" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыНаСкладах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыНаСкладах"

	Дано Я открываю основную форму регистра накопления "ТоварыНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыНаСкладах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыОрганизаций"

	Дано Я открываю основную форму регистра накопления "ТоварыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыОрганизацийКПередаче" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыОрганизацийКПередаче"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизацийКПередаче"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыОрганизацийКПередаче"

	Дано Я открываю основную форму регистра накопления "ТоварыОрганизацийКПередаче"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыОрганизацийКПередаче"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыПереданныеНаКомиссию" 

	Дано Я открываю основную форму списка регистра накопления "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыПереданныеНаКомиссию"

	Дано Я открываю основную форму регистра накопления "ТоварыПереданныеНаКомиссию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварыПереданныеНаКомиссию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиКОформлениюОтчетовПринципалу" 

	Дано Я открываю основную форму списка регистра накопления "УслугиКОформлениюОтчетовПринципалу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиКОформлениюОтчетовПринципалу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиКОформлениюОтчетовПринципалу"

	Дано Я открываю основную форму регистра накопления "УслугиКОформлениюОтчетовПринципалу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УслугиКОформлениюОтчетовПринципалу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФинансовыеРезультаты" 

	Дано Я открываю основную форму списка регистра накопления "ФинансовыеРезультаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФинансовыеРезультаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФинансовыеРезультаты"

	Дано Я открываю основную форму регистра накопления "ФинансовыеРезультаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФинансовыеРезультаты"
	И Я закрываю текущее окно

