#language: ru

@tree

Функционал: Отражение поступление товаров

Как Менеджер по закупкам я хочу
ввести документ поступление товаров
чтобы на складе появились остатки  
Контекст:
	И Я подключаю клиент тестирования "УП Менеджер по закупкам" из таблицы клиентов тестирования
	И я закрываю все окна клиентского приложения

Сценарий: ввод поступление товаров

* Ввод документа
	И В командном интерфейсе я выбираю 'Главное' 'Поступления товаров'
	Тогда открылось окно 'Поступления товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Поступление товара (создание)'
	И я нажимаю кнопку выбора у поля с именем "Организация"
	И из выпадающего списка с именем "Организация" я выбираю по строке 'ВА -Организация'
	И я перехожу к следующему реквизиту
	И я нажимаю кнопку выбора у поля с именем "Склад"
	И из выпадающего списка с именем "Склад" я выбираю по строке 'ВА Оптовый'
	И я перехожу к следующему реквизиту
	И из выпадающего списка с именем "Поставщик" я выбираю по строке 'ВА Поставщик(оптовый)'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я активизирую поле с именем "ТоварыТовар"
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я перехожу к строке:
		| 'N' |
		| '1' |
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю по строке 'ВА Товар от Поставщика (оптовый)'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я активизирую поле с именем "ТоварыАртикул"
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '100,00'
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '15,00'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я перехожу к строке:
		| 'N' |
		| '2' |
	И в таблице "Товары" я активизирую поле с именем "ТоварыТовар"
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю по строке 'ВА Товар от Поставщика (оптовый)'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я активизирую поле с именем "ТоварыАртикул"
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '120,00'
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '11,00'
	И в таблице "Товары" я активизирую поле с именем "ТоварыСумма"
	И в таблице "Товары" я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Поступление товара (создание) *' в течение 20 секунд
* Проверка заполнения
	Тогда открылось окно 'Поступления товаров'
	И в таблице "Список" я выбираю текущую строку
	И элемент формы с именем "Организация" стал равен 'ВА -Организация'
	И элемент формы с именем "Поставщик" стал равен 'ВА Поставщик(оптовый)'
	И элемент формы с именем "Склад" стал равен 'ВА Оптовый'
	И таблица "Товары" стала равной:
		| 'N' | 'Товар'                            | 'Артикул' | 'Цена'   | 'Количество' | 'Сумма'    |
		| '1' | 'ВА Товар от Поставщика (оптовый)' | '123456'  | '100,00' | '15,00'      | '1 500,00' |
		| '2' | 'ВА Товар от Поставщика (оптовый)' | '123456'  | '120,00' | '11,00'      | '1 320,00' |
	
	И элемент формы с именем "ТоварыИтогКоличество" стал равен '26'
	И элемент формы с именем "ТоварыИтогСумма" стал равен '2 820'	
* Проверка движения
   *Взаиморасчеты
	Когда открылось окно 'Поступление товара * от *'
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
	И в таблице "Список" количество строк " равно" 1 Тогда
	Тогда таблица "Список" стала равной по шаблону:
		| 'Регистратор'        | 'Номер строки' | 'Контрагент'            | 'Сумма'    |
		| 'Поступление * от *' | '1'            | 'ВА Поставщик(оптовый)' | '2 820,00' |

   *Остатки
		Когда открылось окно 'Поступление товара * от *'
		И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр товарных запасов'
        И в таблице "Список" количество строк " равно" 2 Тогда
		
		И таблица "Список" содержит строки по шаблону:
			| 'Склад'      | 'Регистратор'               | 'Номер строки' | 'Товар'                            | 'Количество' |
			| 'ВА Оптовый' | 'Поступление товара * от *' | '1'            | 'ВА Товар от Поставщика (оптовый)' | '15,00'      |
			| 'ВА Оптовый' | 'Поступление товара * от *' | '2'            | 'ВА Товар от Поставщика (оптовый)' | '11,00'      |
		
						
	
	И я закрываю сеанс текущего клиента тестирования	
	
